[Timeout] BlockStatement
controllers/authorize.js:3:46
 const { Api400Error } = require("../util/index").apiErrors
 
-exports.authorizedUser = (req, res, next) => {
-  if (req.session.authorized) {
-    next()
-    return
-  }
-  throw new Api400Error("Client needs to login to view this page.")
-}
+exports.authorizedUser = (req, res, next) => {}
 

[NoCoverage] BlockStatement
controllers/authorize.js:4:31
 const { Api400Error } = require("../util/index").apiErrors
 
 exports.authorizedUser = (req, res, next) => {
-  if (req.session.authorized) {
-    next()
-    return
-  }
+  if (req.session.authorized) {}
   throw new Api400Error("Client needs to login to view this page.")
 }

[NoCoverage] ConditionalExpression
controllers/authorize.js:4:7
 const { Api400Error } = require("../util/index").apiErrors
 
 exports.authorizedUser = (req, res, next) => {
-  if (req.session.authorized) {
+  if (true) {
     next()
     return
