[NoCoverage] BlockStatement
app.js:11:35
 
 let server = ""
 
-const initializeWebServer = () => {
-  return new Promise((resolve) => {
-    const PORT = process.env.PORT || 0
-
-    server = https
-      .createServer(
-        {
-          key: privateKey,
-          cert: privateCertificate,
-        },
-        app
-      )
-      .listen(PORT, () => {
-        console.log(
-          `Server is live at https://localhost:${server.address().port}`
-        )
-
-        resolve(server.address())
-      })
-  })
-}
+const initializeWebServer = () => {}
 
 const stopWebServer = () => {

[Timeout] BlockStatement
app.js:12:35
 let server = ""
 
 const initializeWebServer = () => {
-  return new Promise((resolve) => {
-    const PORT = process.env.PORT || 0
-
-    server = https
-      .createServer(
-        {
-          key: privateKey,
-          cert: privateCertificate,
-        },
-        app
-      )
-      .listen(PORT, () => {
-        console.log(
-          `Server is live at https://localhost:${server.address().port}`
-        )
-
-        resolve(server.address())
-      })
-  })
+  return new Promise((resolve) => {})
 }
 

[NoCoverage] ConditionalExpression
app.js:13:18
 
 const initializeWebServer = () => {
   return new Promise((resolve) => {
-    const PORT = process.env.PORT || 0
+    const PORT = true
 
     server = https

[Survived] LogicalOperator
app.js:13:18
 
 const initializeWebServer = () => {
   return new Promise((resolve) => {
-    const PORT = process.env.PORT || 0
+    const PORT = process.env.PORT && 0
 
     server = https

[Timeout] BlockStatement
app.js:23:27
         },
         app
       )
-      .listen(PORT, () => {
-        console.log(
-          `Server is live at https://localhost:${server.address().port}`
-        )
-
-        resolve(server.address())
-      })
+      .listen(PORT, () => {})
   })
 }

[Survived] StringLiteral
app.js:25:11
       )
       .listen(PORT, () => {
         console.log(
-          `Server is live at https://localhost:${server.address().port}`
+          ``
         )
 

[Survived] BlockStatement
app.js:33:29
   })
 }
 
-const stopWebServer = () => {
-  return new Promise((resolve) => {
-    server.close(() => {
-      resolve()
-    })
-  })
-}
+const stopWebServer = () => {}
 
 module.exports = { initializeWebServer, stopWebServer, privateCertificate }

[Timeout] BlockStatement
app.js:34:35
 }
 
 const stopWebServer = () => {
-  return new Promise((resolve) => {
-    server.close(() => {
-      resolve()
-    })
-  })
+  return new Promise((resolve) => {})
 }
 

[Timeout] BlockStatement
app.js:35:24
 
 const stopWebServer = () => {
   return new Promise((resolve) => {
-    server.close(() => {
-      resolve()
-    })
+    server.close(() => {})
   })
 }
