[Survived] ArrayDeclaration
controllers/captions.js:9:12
   require("../util/index").search
 
 const otherOptions = {
-  include: [
-    {
-      model: models.User,
-      as: "author",
-      attributes: { exclude: ["password"] },
-    },
-  ],
+  include: [],
   order: [["votes", "DESC"]],
 }

[Survived] ObjectLiteral
controllers/captions.js:10:5
 
 const otherOptions = {
   include: [
-    {
-      model: models.User,
-      as: "author",
-      attributes: { exclude: ["password"] },
-    },
+    {},
   ],
   order: [["votes", "DESC"]],

[Survived] ObjectLiteral
controllers/captions.js:13:19
     {
       model: models.User,
       as: "author",
-      attributes: { exclude: ["password"] },
+      attributes: {},
     },
   ],

[Survived] ObjectLiteral
controllers/captions.js:19:27
   order: [["votes", "DESC"]],
 }
 
-const topCaptionsSearch = {
-  ...otherOptions,
-  limit: 10,
-}
+const topCaptionsSearch = {}
 
 exports.paramCaptionId = async (req, res, next, captionId) => {

[Timeout] BlockStatement
controllers/captions.js:24:63
   limit: 10,
 }
 
-exports.paramCaptionId = async (req, res, next, captionId) => {
-  const user = req.session.user
-
-  try {
-    await integerValidator("captionId", true).run(req)
-
-    validationPerusal(req, `User: ${user.id}`)
-
-    const searchParams = whereSearch({ id: captionId }, otherOptions)
-
-    const searched = await models.Caption.findOne(searchParams)
-
-    if (!searched) {
-      throw new Api404Error(
-        `User: ${user.id} caption was not found given caption id ${captionId}.`
-      )
-    }
-
-    req.caption = searched.dataValues
-
-    next()
-  } catch (err) {
-    next(err)
-  }
-}
+exports.paramCaptionId = async (req, res, next, captionId) => {}
 
 exports.postCaption = async (req, res, next) => {

[Timeout] BlockStatement
controllers/captions.js:27:7
 exports.paramCaptionId = async (req, res, next, captionId) => {
   const user = req.session.user
 
-  try {
-    await integerValidator("captionId", true).run(req)
-
-    validationPerusal(req, `User: ${user.id}`)
-
-    const searchParams = whereSearch({ id: captionId }, otherOptions)
-
-    const searched = await models.Caption.findOne(searchParams)
-
-    if (!searched) {
-      throw new Api404Error(
-        `User: ${user.id} caption was not found given caption id ${captionId}.`
-      )
-    }
-
-    req.caption = searched.dataValues
-
-    next()
-  } catch (err) {
+  try {} catch (err) {
     next(err)
   }

[NoCoverage] BooleanLiteral
controllers/captions.js:28:41
   const user = req.session.user
 
   try {
-    await integerValidator("captionId", true).run(req)
+    await integerValidator("captionId", false).run(req)
 
     validationPerusal(req, `User: ${user.id}`)

[Survived] StringLiteral
controllers/captions.js:30:28
   try {
     await integerValidator("captionId", true).run(req)
 
-    validationPerusal(req, `User: ${user.id}`)
+    validationPerusal(req, ``)
 
     const searchParams = whereSearch({ id: captionId }, otherOptions)

[NoCoverage] ConditionalExpression
controllers/captions.js:36:9
 
     const searched = await models.Caption.findOne(searchParams)
 
-    if (!searched) {
+    if (true) {
       throw new Api404Error(
         `User: ${user.id} caption was not found given caption id ${captionId}.`

[Timeout] BlockStatement
controllers/captions.js:45:17
     req.caption = searched.dataValues
 
     next()
-  } catch (err) {
-    next(err)
-  }
+  } catch (err) {}
 }
 

[NoCoverage] StringLiteral
controllers/captions.js:52:23
 
 exports.postCaption = async (req, res, next) => {
   const user = req.session.user
-  const preErrorMsg = `User: ${user.id}`
+  const preErrorMsg = ``
 
   try {

[Timeout] BlockStatement
controllers/captions.js:54:7
   const user = req.session.user
   const preErrorMsg = `User: ${user.id}`
 
-  try {
-    validationPerusal(req, preErrorMsg)
-
-    const { photoId, text } = req.body
-
-    const values = {
-      userId: user.id,
-      photoId,
-      text,
-    }
-
-    const created = await models.Caption.create(values)
-
-    if (!created) {
-      throw new Api500Error(`User: ${user.id} create query did not work.`)
-    }
-
-    res.status(201).send(`User: ${user.id} caption has been created.`)
-  } catch (err) {
+  try {} catch (err) {
     next(err)
   }

[NoCoverage] BlockStatement
controllers/captions.js:67:19
 
     const created = await models.Caption.create(values)
 
-    if (!created) {
-      throw new Api500Error(`User: ${user.id} create query did not work.`)
-    }
+    if (!created) {}
 
     res.status(201).send(`User: ${user.id} caption has been created.`)

[NoCoverage] ConditionalExpression
controllers/captions.js:67:9
 
     const created = await models.Caption.create(values)
 
-    if (!created) {
+    if (false) {
       throw new Api500Error(`User: ${user.id} create query did not work.`)
     }

[NoCoverage] StringLiteral
controllers/captions.js:68:29
     const created = await models.Caption.create(values)
 
     if (!created) {
-      throw new Api500Error(`User: ${user.id} create query did not work.`)
+      throw new Api500Error(``)
     }
 

[NoCoverage] BlockStatement
controllers/captions.js:72:17
     }
 
     res.status(201).send(`User: ${user.id} caption has been created.`)
-  } catch (err) {
-    next(err)
-  }
+  } catch (err) {}
 }
 

[Timeout] BlockStatement
controllers/captions.js:81:7
   const user = req.session.user
   const preErrorMsg = `User: ${user.id}`
 
-  try {
-    validationPerusal(req, preErrorMsg)
-
-    const { afterMsg, searchParams } = inputsToSearch(
-      req,
-      topCaptionsSearch,
-      otherOptions
-    )
-
-    const searched = await models.Caption.findAll(searchParams)
-
-    if (!searched) {
-      throw new Api401Error(
-        `User: ${user.id} captions were not found ` + afterMsg
-      )
-    }
-
-    res.json(searched)
-  } catch (err) {
+  try {} catch (err) {
     next(err)
   }

[NoCoverage] BooleanLiteral
controllers/captions.js:92:9
 
     const searched = await models.Caption.findAll(searchParams)
 
-    if (!searched) {
+    if (searched) {
       throw new Api401Error(
         `User: ${user.id} captions were not found ` + afterMsg

[NoCoverage] ConditionalExpression
controllers/captions.js:92:9
 
     const searched = await models.Caption.findAll(searchParams)
 
-    if (!searched) {
+    if (false) {
       throw new Api401Error(
         `User: ${user.id} captions were not found ` + afterMsg

[NoCoverage] BlockStatement
controllers/captions.js:99:17
     }
 
     res.json(searched)
-  } catch (err) {
-    next(err)
-  }
+  } catch (err) {}
 }
 

[Timeout] BlockStatement
controllers/captions.js:104:42
   }
 }
 
-exports.getCaption = async (req, res) => {
-  const caption = req.caption
-
-  res.json(caption)
-}
+exports.getCaption = async (req, res) => {}
 
 exports.putCaption = async (req, res, next) => {

[Timeout] BlockStatement
controllers/captions.js:115:7
   const caption = req.caption
   const { text } = req.body
 
-  try {
-    if (caption.userId !== user.id) {
-      throw new Api403Error(
-        `User: ${user.id} cannot update a caption that does not belong to them.`
-      )
-    }
-
-    const updatedValues = { text }
-
-    const updated = await models.Caption.update(updatedValues, {
-      where: { id: caption.id },
-    })
-
-    if (!updated) {
-      throw new Api500Error(
-        `User: ${user.id} update caption text query did not work.`
-      )
-    }
-
-    res.send(
-      `User: ${user.id} has updated one of their caption with id ${caption.id}.`
-    )
-  } catch (err) {
+  try {} catch (err) {
     next(err)
   }

[NoCoverage] EqualityOperator
controllers/captions.js:116:9
   const { text } = req.body
 
   try {
-    if (caption.userId !== user.id) {
+    if (caption.userId === user.id) {
       throw new Api403Error(
         `User: ${user.id} cannot update a caption that does not belong to them.`

[NoCoverage] ConditionalExpression
controllers/captions.js:116:9
   const { text } = req.body
 
   try {
-    if (caption.userId !== user.id) {
+    if (true) {
       throw new Api403Error(
         `User: ${user.id} cannot update a caption that does not belong to them.`

[Survived] StringLiteral
controllers/captions.js:118:9
   try {
     if (caption.userId !== user.id) {
       throw new Api403Error(
-        `User: ${user.id} cannot update a caption that does not belong to them.`
+        ``
       )
     }

[NoCoverage] ObjectLiteral
controllers/captions.js:122:27
       )
     }
 
-    const updatedValues = { text }
+    const updatedValues = {}
 
     const updated = await models.Caption.update(updatedValues, {

[NoCoverage] ConditionalExpression
controllers/captions.js:128:9
       where: { id: caption.id },
     })
 
-    if (!updated) {
+    if (false) {
       throw new Api500Error(
         `User: ${user.id} update caption text query did not work.`

[NoCoverage] StringLiteral
controllers/captions.js:130:9
 
     if (!updated) {
       throw new Api500Error(
-        `User: ${user.id} update caption text query did not work.`
+        ``
       )
     }

[Timeout] BlockStatement
controllers/captions.js:137:17
     res.send(
       `User: ${user.id} has updated one of their caption with id ${caption.id}.`
     )
-  } catch (err) {
-    next(err)
-  }
+  } catch (err) {}
 }
 

[NoCoverage] ConditionalExpression
controllers/captions.js:146:7
   const user = req.session.user
   const preErrorMsg = `User: ${user.id}`
   const targetIsSelf = user.isAdmin
-    ? user.id === req.body.userId
+    ? true
     : req.body.userId === undefined || user.id === req.body.userId
   const responseMsg = targetIsSelf

[NoCoverage] ConditionalExpression
controllers/captions.js:146:7
   const user = req.session.user
   const preErrorMsg = `User: ${user.id}`
   const targetIsSelf = user.isAdmin
-    ? user.id === req.body.userId
+    ? false
     : req.body.userId === undefined || user.id === req.body.userId
   const responseMsg = targetIsSelf

[NoCoverage] ConditionalExpression
controllers/captions.js:147:7
   const preErrorMsg = `User: ${user.id}`
   const targetIsSelf = user.isAdmin
     ? user.id === req.body.userId
-    : req.body.userId === undefined || user.id === req.body.userId
+    : false
   const responseMsg = targetIsSelf
     ? `User: ${user.id} has deleted all of their own captions associated`

[NoCoverage] ConditionalExpression
controllers/captions.js:147:7
   const preErrorMsg = `User: ${user.id}`
   const targetIsSelf = user.isAdmin
     ? user.id === req.body.userId
-    : req.body.userId === undefined || user.id === req.body.userId
+    : false || user.id === req.body.userId
   const responseMsg = targetIsSelf
     ? `User: ${user.id} has deleted all of their own captions associated`

[NoCoverage] StringLiteral
controllers/captions.js:149:7
     ? user.id === req.body.userId
     : req.body.userId === undefined || user.id === req.body.userId
   const responseMsg = targetIsSelf
-    ? `User: ${user.id} has deleted all of their own captions associated`
+    ? ``
     : `User: ${user.id} has deleted all of the captions associated`
 

[NoCoverage] StringLiteral
controllers/captions.js:150:7
     : req.body.userId === undefined || user.id === req.body.userId
   const responseMsg = targetIsSelf
     ? `User: ${user.id} has deleted all of their own captions associated`
-    : `User: ${user.id} has deleted all of the captions associated`
+    : ``
 
   try {

[Timeout] BlockStatement
controllers/captions.js:152:7
     ? `User: ${user.id} has deleted all of their own captions associated`
     : `User: ${user.id} has deleted all of the captions associated`
 
-  try {
-    if (!targetIsSelf && !user.isAdmin) {
-      throw new Api403Error(
-        `User: ${user.id} cannot delete photos that does not belong to them.`
-      )
-    }
-
-    validationPerusal(req, preErrorMsg)
-
-    const { afterMsg, searchParams } = inputsToSearch(
-      req,
-      selfSearch(user.id),
-      {}
-    )
-    console.log(searchParams)
-    const deleted = await models.Caption.destroy(searchParams)
-
-    if (!deleted) {
-      throw new Api500Error(
-        `User: ${user.id} delete photos query did not work ` + afterMsg
-      )
-    }
-
-    res.send(responseMsg + afterMsg)
-  } catch (err) {
+  try {} catch (err) {
     next(err)
   }

[NoCoverage] LogicalOperator
controllers/captions.js:153:9
     : `User: ${user.id} has deleted all of the captions associated`
 
   try {
-    if (!targetIsSelf && !user.isAdmin) {
+    if (!targetIsSelf || !user.isAdmin) {
       throw new Api403Error(
         `User: ${user.id} cannot delete photos that does not belong to them.`

[NoCoverage] ConditionalExpression
controllers/captions.js:153:9
     : `User: ${user.id} has deleted all of the captions associated`
 
   try {
-    if (!targetIsSelf && !user.isAdmin) {
+    if (true) {
       throw new Api403Error(
         `User: ${user.id} cannot delete photos that does not belong to them.`

[Survived] StringLiteral
controllers/captions.js:155:9
   try {
     if (!targetIsSelf && !user.isAdmin) {
       throw new Api403Error(
-        `User: ${user.id} cannot delete photos that does not belong to them.`
+        ``
       )
     }

[Survived] ConditionalExpression
controllers/captions.js:169:9
     console.log(searchParams)
     const deleted = await models.Caption.destroy(searchParams)
 
-    if (!deleted) {
+    if (false) {
       throw new Api500Error(
         `User: ${user.id} delete photos query did not work ` + afterMsg

[NoCoverage] BlockStatement
controllers/captions.js:169:19
     console.log(searchParams)
     const deleted = await models.Caption.destroy(searchParams)
 
-    if (!deleted) {
-      throw new Api500Error(
-        `User: ${user.id} delete photos query did not work ` + afterMsg
-      )
-    }
+    if (!deleted) {}
 
     res.send(responseMsg + afterMsg)

[NoCoverage] StringLiteral
controllers/captions.js:171:9
 
     if (!deleted) {
       throw new Api500Error(
-        `User: ${user.id} delete photos query did not work ` + afterMsg
+        `` + afterMsg
       )
     }

[Timeout] BlockStatement
controllers/captions.js:176:17
     }
 
     res.send(responseMsg + afterMsg)
-  } catch (err) {
-    next(err)
-  }
+  } catch (err) {}
 }
 

[NoCoverage] ConditionalExpression
controllers/captions.js:184:24
 exports.deleteCaption = async (req, res, next) => {
   const caption = req.caption
   const user = req.session.user
-  const targetIsSelf = caption.userId === user.id
+  const targetIsSelf = true
   const responseMsg = targetIsSelf
     ? `User: ${user.id} has deleted one of their own captions.`

[NoCoverage] EqualityOperator
controllers/captions.js:184:24
 exports.deleteCaption = async (req, res, next) => {
   const caption = req.caption
   const user = req.session.user
-  const targetIsSelf = caption.userId === user.id
+  const targetIsSelf = caption.userId !== user.id
   const responseMsg = targetIsSelf
     ? `User: ${user.id} has deleted one of their own captions.`

[NoCoverage] BlockStatement
controllers/captions.js:189:7
     ? `User: ${user.id} has deleted one of their own captions.`
     : `User: ${user.id} has deleted one of user id ${caption.userId} captions.`
 
-  try {
-    if (!targetIsSelf && !user.isAdmin) {
-      throw new Api403Error(
-        `User: ${user.id} cannot delete a caption that does not belong to them.`
-      )
-    }
-
-    const deleted = await models.Caption.destroy({
-      where: { id: caption.id },
-    })
-
-    if (!deleted) {
-      throw new Api500Error(
-        `User: ${user.id} delete caption with caption id query did not work.`
-      )
-    }
-
-    res.send(responseMsg)
-  } catch (err) {
+  try {} catch (err) {
     next(err)
   }

[NoCoverage] BooleanLiteral
controllers/captions.js:200:9
       where: { id: caption.id },
     })
 
-    if (!deleted) {
+    if (deleted) {
       throw new Api500Error(
         `User: ${user.id} delete caption with caption id query did not work.`

[NoCoverage] BlockStatement
controllers/captions.js:200:19
       where: { id: caption.id },
     })
 
-    if (!deleted) {
-      throw new Api500Error(
-        `User: ${user.id} delete caption with caption id query did not work.`
-      )
-    }
+    if (!deleted) {}
 
     res.send(responseMsg)

[NoCoverage] BlockStatement
controllers/captions.js:207:17
     }
 
     res.send(responseMsg)
-  } catch (err) {
-    next(err)
-  }
+  } catch (err) {}
 }
 
