[Survived] BlockStatement
controllers/errorHandlers.js:6:27
 const { logger } = require("../util/index")
 const { BaseError } = require("../util/index")
 
-const logError = (err) => {
-  logger.error(err)
-}
+const logError = (err) => {}
 
 const isOperationalError = (err) => {

[NoCoverage] BlockStatement
controllers/errorHandlers.js:10:37
   logger.error(err)
 }
 
-const isOperationalError = (err) => {
-  if (err instanceof BaseError) {
-    return err.isOperational
-  }
-
-  return false
-}
+const isOperationalError = (err) => {}
 
 const logErrorMiddleware = async (err, req, res, next) => {

[NoCoverage] BlockStatement
controllers/errorHandlers.js:11:33
 }
 
 const isOperationalError = (err) => {
-  if (err instanceof BaseError) {
-    return err.isOperational
-  }
+  if (err instanceof BaseError) {}
 
   return false

[NoCoverage] ConditionalExpression
controllers/errorHandlers.js:11:7
 }
 
 const isOperationalError = (err) => {
-  if (err instanceof BaseError) {
+  if (false) {
     return err.isOperational
   }

[Timeout] BlockStatement
controllers/errorHandlers.js:18:59
   return false
 }
 
-const logErrorMiddleware = async (err, req, res, next) => {
-  if (!(err.code === "EBADCSRFTOKEN") && !isOperationalError(err)) {
-    throw err
-  }
-
-  logError(err)
-
-  next(err)
-}
+const logErrorMiddleware = async (err, req, res, next) => {}
 
 const returnError = (err, req, res, next) => {

[NoCoverage] BooleanLiteral
controllers/errorHandlers.js:19:7
 }
 
 const logErrorMiddleware = async (err, req, res, next) => {
-  if (!(err.code === "EBADCSRFTOKEN") && !isOperationalError(err)) {
+  if (err.code === "EBADCSRFTOKEN" && !isOperationalError(err)) {
     throw err
   }

[Survived] ConditionalExpression
controllers/errorHandlers.js:19:9
 }
 
 const logErrorMiddleware = async (err, req, res, next) => {
-  if (!(err.code === "EBADCSRFTOKEN") && !isOperationalError(err)) {
+  if (!(true) && !isOperationalError(err)) {
     throw err
   }

[Timeout] BlockStatement
controllers/errorHandlers.js:28:46
   next(err)
 }
 
-const returnError = (err, req, res, next) => {
-  res.status(err.statusCode || 500).send(err.message)
-}
+const returnError = (err, req, res, next) => {}
 
 module.exports = {

[NoCoverage] LogicalOperator
controllers/errorHandlers.js:29:14
 }
 
 const returnError = (err, req, res, next) => {
-  res.status(err.statusCode || 500).send(err.message)
+  res.status(err.statusCode && 500).send(err.message)
 }
 
