[Timeout] BlockStatement
controllers/register.js:6:43
 const { Api400Error, Api500Error } = require("../util/index").apiErrors
 const { passwordHash } = require("../util/index").passwordHash
 
-exports.getRegister = async (req, res) => {
-  res.status(200).send()
-}
+exports.getRegister = async (req, res) => {}
 
 exports.postRegister = async (req, res, next) => {

[NoCoverage] StringLiteral
controllers/register.js:13:59
 exports.postRegister = async (req, res, next) => {
   const saltRounds = 10
   try {
-    const { username, password } = validationPerusal(req, "Client:")
+    const { username, password } = validationPerusal(req, "")
 
     const searched = await models.User.findOne({

[NoCoverage] ObjectLiteral
controllers/register.js:15:48
   try {
     const { username, password } = validationPerusal(req, "Client:")
 
-    const searched = await models.User.findOne({
-      where: { username: username },
-    })
+    const searched = await models.User.findOne({})
 
     if (searched) {

[NoCoverage] BlockStatement
controllers/register.js:19:19
       where: { username: username },
     })
 
-    if (searched) {
-      throw new Api400Error(`Client: username ${username} is already in use.`)
-    }
+    if (searched) {}
 
     const hashedPassword = await passwordHash(password, saltRounds)

[NoCoverage] ConditionalExpression
controllers/register.js:19:9
       where: { username: username },
     })
 
-    if (searched) {
+    if (true) {
       throw new Api400Error(`Client: username ${username} is already in use.`)
     }

[Survived] StringLiteral
controllers/register.js:20:29
     })
 
     if (searched) {
-      throw new Api400Error(`Client: username ${username} is already in use.`)
+      throw new Api400Error(``)
     }
 

[NoCoverage] ConditionalExpression
controllers/register.js:30:9
       password: hashedPassword,
     })
 
-    if (!created) {
+    if (true) {
       throw new Api500Error(
         "Client: creating user query failed and was unable to finish."

[NoCoverage] BooleanLiteral
controllers/register.js:30:9
       password: hashedPassword,
     })
 
-    if (!created) {
+    if (created) {
       throw new Api500Error(
         "Client: creating user query failed and was unable to finish."

[NoCoverage] StringLiteral
controllers/register.js:36:26
       )
     }
 
-    res.status(201).send(`User: ${created.dataValues.id} is created.`)
+    res.status(201).send(``)
   } catch (err) {
     next(err)

[Timeout] BlockStatement
controllers/register.js:37:17
     }
 
     res.status(201).send(`User: ${created.dataValues.id} is created.`)
-  } catch (err) {
-    next(err)
-  }
+  } catch (err) {}
 }
 
