[Timeout] BlockStatement
controllers/login.js:5:40
 const { generateToken } = require("../util/index").doubleCsrf
 const { authenticate } = require("../util/index").authenticate
 
-exports.getLogin = async (req, res) => {
-  res.status(200).send()
-}
+exports.getLogin = async (req, res) => {}
 
 exports.postLogin = async (req, res, next) => {

[Timeout] BlockStatement
controllers/login.js:9:47
   res.status(200).send()
 }
 
-exports.postLogin = async (req, res, next) => {
-  try {
-    const { username, password } = validationPerusal(req, "Client:")
-
-    const user = await authenticate(username, password)
-
-    req.session.authorized = true
-    delete user.password
-    req.session.user = user
-
-    const csrfToken = generateToken(req, res, true)
-
-    res.json({
-      message: `User: ${user.id} is now logged in.`,
-      csrfToken,
-    })
-  } catch (err) {
-    next(err)
-  }
-}
+exports.postLogin = async (req, res, next) => {}
 

[Timeout] BlockStatement
controllers/login.js:10:7
 }
 
 exports.postLogin = async (req, res, next) => {
-  try {
-    const { username, password } = validationPerusal(req, "Client:")
-
-    const user = await authenticate(username, password)
-
-    req.session.authorized = true
-    delete user.password
-    req.session.user = user
-
-    const csrfToken = generateToken(req, res, true)
-
-    res.json({
-      message: `User: ${user.id} is now logged in.`,
-      csrfToken,
-    })
-  } catch (err) {
+  try {} catch (err) {
     next(err)
   }

[NoCoverage] BooleanLiteral
controllers/login.js:15:30
 
     const user = await authenticate(username, password)
 
-    req.session.authorized = true
+    req.session.authorized = false
     delete user.password
     req.session.user = user

[Survived] BooleanLiteral
controllers/login.js:19:47
     delete user.password
     req.session.user = user
 
-    const csrfToken = generateToken(req, res, true)
+    const csrfToken = generateToken(req, res, false)
 
     res.json({

[NoCoverage] StringLiteral
controllers/login.js:22:16
     const csrfToken = generateToken(req, res, true)
 
     res.json({
-      message: `User: ${user.id} is now logged in.`,
+      message: ``,
       csrfToken,
     })
