[Timeout] BlockStatement
controllers/logout.js:3:41
 const { generateToken } = require("../util/index").doubleCsrf
 
-exports.getLogout = async (req, res) => {
-  res.send()
-}
+exports.getLogout = async (req, res) => {}
 
 exports.postLogout = async (req, res, next) => {

[Timeout] BlockStatement
controllers/logout.js:7:48
   res.send()
 }
 
-exports.postLogout = async (req, res, next) => {
-  const user = req.session.user
-  try {
-    req.session.authorized = false
-
-    generateToken(req, res, true)
-
-    res.send(`User: ${user.id} is now logged out.`)
-  } catch (err) {
-    next(err)
-  }
-}
+exports.postLogout = async (req, res, next) => {}
 

[Timeout] BlockStatement
controllers/logout.js:9:7
 
 exports.postLogout = async (req, res, next) => {
   const user = req.session.user
-  try {
-    req.session.authorized = false
-
-    generateToken(req, res, true)
-
-    res.send(`User: ${user.id} is now logged out.`)
-  } catch (err) {
+  try {} catch (err) {
     next(err)
   }

[NoCoverage] BooleanLiteral
controllers/logout.js:10:30
 exports.postLogout = async (req, res, next) => {
   const user = req.session.user
   try {
-    req.session.authorized = false
+    req.session.authorized = true
 
     generateToken(req, res, true)

[Survived] BooleanLiteral
controllers/logout.js:12:29
   try {
     req.session.authorized = false
 
-    generateToken(req, res, true)
+    generateToken(req, res, false)
 
     res.send(`User: ${user.id} is now logged out.`)

[NoCoverage] StringLiteral
controllers/logout.js:14:14
 
     generateToken(req, res, true)
 
-    res.send(`User: ${user.id} is now logged out.`)
+    res.send(``)
   } catch (err) {
     next(err)

[NoCoverage] BlockStatement
controllers/logout.js:15:17
     generateToken(req, res, true)
 
     res.send(`User: ${user.id} is now logged out.`)
-  } catch (err) {
-    next(err)
-  }
+  } catch (err) {}
 }
 
