[NoCoverage] BooleanLiteral
controllers/validators.js:9:18
 
 const basicCredentialValidator = (
   input,
-  inputIsParam = false,
+  inputIsParam = true,
   optional = false
 ) => {

[NoCoverage] BooleanLiteral
controllers/validators.js:10:14
 const basicCredentialValidator = (
   input,
   inputIsParam = false,
-  optional = false
+  optional = true
 ) => {
   const inputName = sentenceCase(input)

[Survived] ConditionalExpression
controllers/validators.js:16:7
   let requestProperty = inputIsParam ? param : body
   let head = requestProperty(input)
 
-  if (!inputIsParam) {
+  if (true) {
     if (optional) {
       head = head.optional({ nullable: true, checkFalsy: true })

[Survived] ConditionalExpression
controllers/validators.js:16:7
   let requestProperty = inputIsParam ? param : body
   let head = requestProperty(input)
 
-  if (!inputIsParam) {
+  if (false) {
     if (optional) {
       head = head.optional({ nullable: true, checkFalsy: true })

[Survived] ConditionalExpression
controllers/validators.js:17:9
   let head = requestProperty(input)
 
   if (!inputIsParam) {
-    if (optional) {
+    if (true) {
       head = head.optional({ nullable: true, checkFalsy: true })
     }

[Survived] BlockStatement
controllers/validators.js:17:19
   let head = requestProperty(input)
 
   if (!inputIsParam) {
-    if (optional) {
-      head = head.optional({ nullable: true, checkFalsy: true })
-    }
+    if (optional) {}
 
     head = head.notEmpty().withMessage(inputName + " must not be empty.")

[Survived] BooleanLiteral
controllers/validators.js:18:58
 
   if (!inputIsParam) {
     if (optional) {
-      head = head.optional({ nullable: true, checkFalsy: true })
+      head = head.optional({ nullable: true, checkFalsy: false })
     }
 

[Survived] BooleanLiteral
controllers/validators.js:18:40
 
   if (!inputIsParam) {
     if (optional) {
-      head = head.optional({ nullable: true, checkFalsy: true })
+      head = head.optional({ nullable: false, checkFalsy: true })
     }
 

[Survived] StringLiteral
controllers/validators.js:21:52
       head = head.optional({ nullable: true, checkFalsy: true })
     }
 
-    head = head.notEmpty().withMessage(inputName + " must not be empty.")
+    head = head.notEmpty().withMessage(inputName + "")
   }
 

[NoCoverage] BlockStatement
controllers/validators.js:24:33
     head = head.notEmpty().withMessage(inputName + " must not be empty.")
   }
 
-  return head.custom((value) => {
-    if (value.includes(" ")) {
-      throw new Error(inputName + " must no have any blank spaces.")
-    }
-    return true
-  })
+  return head.custom((value) => {})
 }
 

[NoCoverage] ConditionalExpression
controllers/validators.js:25:9
   }
 
   return head.custom((value) => {
-    if (value.includes(" ")) {
+    if (true) {
       throw new Error(inputName + " must no have any blank spaces.")
     }

[NoCoverage] BlockStatement
controllers/validators.js:25:30
   }
 
   return head.custom((value) => {
-    if (value.includes(" ")) {
-      throw new Error(inputName + " must no have any blank spaces.")
-    }
+    if (value.includes(" ")) {}
     return true
   })

[Survived] BooleanLiteral
controllers/validators.js:34:18
 
 const usernameValidator = (
   input = "username",
-  inputIsParam = false,
+  inputIsParam = true,
   optional = false
 ) => {

[Survived] StringLiteral
controllers/validators.js:42:19
   return head
     .isLength({ min: 4, max: 20 })
     .withMessage(
-      inputName + " must be at least 4 characters and at most 20 characters."
+      inputName + ""
     )
 }

[Survived] BooleanLiteral
controllers/validators.js:50:18
 
 const passwordValidator = (
   input = "password",
-  inputIsParam = false,
+  inputIsParam = true,
   optional = false
 ) => {

[Killed] ObjectLiteral
controllers/validators.js:57:15
   const head = basicCredentialValidator(input, inputIsParam, optional)
 
   return head
-    .isLength({ min: 8, max: 20 })
+    .isLength({})
     .withMessage(
       inputName + " must be at least 8 characters and at most 20 characters."
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Killed] StringLiteral
controllers/validators.js:61:14
     .withMessage(
       inputName + " must be at least 8 characters and at most 20 characters."
     )
-    .matches("[0-9]")
+    .matches("")
     .withMessage(inputName + " must contain a number.")
     .matches("[A-Z]")
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Survived] StringLiteral
controllers/validators.js:64:30
     .matches("[0-9]")
     .withMessage(inputName + " must contain a number.")
     .matches("[A-Z]")
-    .withMessage(inputName + " must contain an uppercase letter.")
+    .withMessage(inputName + "")
 }
 

[NoCoverage] BooleanLiteral
controllers/validators.js:69:65
 
 exports.passwordValidator = passwordValidator
 
-const basicValidator = (input, inputIsParam = false, optional = false) => {
+const basicValidator = (input, inputIsParam = false, optional = true) => {
   const inputName = sentenceCase(input)
   const requestProperty = inputIsParam ? param : body

[NoCoverage] BooleanLiteral
controllers/validators.js:69:47
 
 exports.passwordValidator = passwordValidator
 
-const basicValidator = (input, inputIsParam = false, optional = false) => {
+const basicValidator = (input, inputIsParam = true, optional = false) => {
   const inputName = sentenceCase(input)
   const requestProperty = inputIsParam ? param : body

[Survived] ConditionalExpression
controllers/validators.js:74:7
   const requestProperty = inputIsParam ? param : body
   let head = requestProperty(input)
 
-  if (optional) {
+  if (true) {
     head = head.optional({ nullable: true, checkFalsy: true })
   }

[Survived] BlockStatement
controllers/validators.js:74:17
   const requestProperty = inputIsParam ? param : body
   let head = requestProperty(input)
 
-  if (optional) {
-    head = head.optional({ nullable: true, checkFalsy: true })
-  }
+  if (optional) {}
 
   return { head, inputName }

[Killed] BooleanLiteral
controllers/validators.js:81:67
   return { head, inputName }
 }
 
-const integerValidator = (input, inputIsParam = false, optional = false) => {
+const integerValidator = (input, inputIsParam = false, optional = true) => {
   const { head, inputName } = basicValidator(input, inputIsParam, optional)
 
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Survived] BooleanLiteral
controllers/validators.js:81:49
   return { head, inputName }
 }
 
-const integerValidator = (input, inputIsParam = false, optional = false) => {
+const integerValidator = (input, inputIsParam = true, optional = false) => {
   const { head, inputName } = basicValidator(input, inputIsParam, optional)
 

[Survived] StringLiteral
controllers/validators.js:84:47
 const integerValidator = (input, inputIsParam = false, optional = false) => {
   const { head, inputName } = basicValidator(input, inputIsParam, optional)
 
-  return head.isInt().withMessage(inputName + " must be an integer.")
+  return head.isInt().withMessage(inputName + "")
 }
 

[Killed] BooleanLiteral
controllers/validators.js:89:64
 
 exports.integerValidator = integerValidator
 
-const textValidator = (input, inputIsParam = false, optional = false) => {
+const textValidator = (input, inputIsParam = false, optional = true) => {
   const { head, inputName } = basicValidator(input, inputIsParam, optional)
 
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(5) ] to have the same members as [ …(3) ]

[Killed] BooleanLiteral
controllers/validators.js:89:46
 
 exports.integerValidator = integerValidator
 
-const textValidator = (input, inputIsParam = false, optional = false) => {
+const textValidator = (input, inputIsParam = true, optional = false) => {
   const { head, inputName } = basicValidator(input, inputIsParam, optional)
 
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(5) ] to have the same members as [ …(3) ]

[Killed] MethodExpression
controllers/validators.js:92:10
 const textValidator = (input, inputIsParam = false, optional = false) => {
   const { head, inputName } = basicValidator(input, inputIsParam, optional)
 
-  return head
-    .trim()
+  return head
     .notEmpty()
     .withMessage(inputName + " must not be empty.")
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(5) ] to have the same members as [ …(3) ]

[Survived] StringLiteral
controllers/validators.js:95:30
   return head
     .trim()
     .notEmpty()
-    .withMessage(inputName + " must not be empty.")
+    .withMessage(inputName + "")
 }
 

[NoCoverage] BlockStatement
controllers/validators.js:100:58
 
 exports.textValidator = textValidator
 
-const captionsMultiInputCheck = (allowedInputsInBody) => {
-  if (
-    !allowedInputsInBody.includes("userId") &&
-    !allowedInputsInBody.includes("photoId")
-  ) {
-    throw Error(
-      'the request body object must include "photoId" and "userId" if two key-value pairs are given.'
-    )
-  }
-
-  return true
-}
+const captionsMultiInputCheck = (allowedInputsInBody) => {}
 
 const allowedBodyInputsValidator = (

[Survived] ConditionalExpression
controllers/validators.js:102:5
 
 const captionsMultiInputCheck = (allowedInputsInBody) => {
   if (
-    !allowedInputsInBody.includes("userId") &&
-    !allowedInputsInBody.includes("photoId")
+    false
   ) {
     throw Error(

[Survived] LogicalOperator
controllers/validators.js:102:5
 
 const captionsMultiInputCheck = (allowedInputsInBody) => {
   if (
-    !allowedInputsInBody.includes("userId") &&
-    !allowedInputsInBody.includes("photoId")
+    !allowedInputsInBody.includes("userId") || !allowedInputsInBody.includes("photoId")
   ) {
     throw Error(

[NoCoverage] BooleanLiteral
controllers/validators.js:103:5
 const captionsMultiInputCheck = (allowedInputsInBody) => {
   if (
     !allowedInputsInBody.includes("userId") &&
-    !allowedInputsInBody.includes("photoId")
+    allowedInputsInBody.includes("photoId")
   ) {
     throw Error(

[NoCoverage] BlockStatement
controllers/validators.js:104:5
   if (
     !allowedInputsInBody.includes("userId") &&
     !allowedInputsInBody.includes("photoId")
-  ) {
-    throw Error(
-      'the request body object must include "photoId" and "userId" if two key-value pairs are given.'
-    )
-  }
+  ) {}
 
   return true

[NoCoverage] BooleanLiteral
controllers/validators.js:115:21
 
 const allowedBodyInputsValidator = (
   allowedInputs,
-  isCaptionsRoute = false,
+  isCaptionsRoute = true,
   maxAllowedInputs = false
 ) => {

[NoCoverage] BooleanLiteral
controllers/validators.js:116:22
 const allowedBodyInputsValidator = (
   allowedInputs,
   isCaptionsRoute = false,
-  maxAllowedInputs = false
+  maxAllowedInputs = true
 ) => {
   if (!maxAllowedInputs) {

[Survived] ConditionalExpression
controllers/validators.js:118:7
   isCaptionsRoute = false,
   maxAllowedInputs = false
 ) => {
-  if (!maxAllowedInputs) {
+  if (false) {
     maxAllowedInputs = allowedInputs.length - 1
   }

[Survived] ConditionalExpression
controllers/validators.js:118:7
   isCaptionsRoute = false,
   maxAllowedInputs = false
 ) => {
-  if (!maxAllowedInputs) {
+  if (true) {
     maxAllowedInputs = allowedInputs.length - 1
   }

[NoCoverage] ArithmeticOperator
controllers/validators.js:119:24
   maxAllowedInputs = false
 ) => {
   if (!maxAllowedInputs) {
-    maxAllowedInputs = allowedInputs.length - 1
+    maxAllowedInputs = allowedInputs.length + 1
   }
 

[Survived] StringLiteral
controllers/validators.js:122:32
     maxAllowedInputs = allowedInputs.length - 1
   }
 
-  let afterNonUniqueErrorMsg = ""
+  let afterNonUniqueErrorMsg = "Stryker was here!"
 
   for (let i = 0; i < allowedInputs.length; i++) {

[Killed] EqualityOperator
controllers/validators.js:124:19
 
   let afterNonUniqueErrorMsg = ""
 
-  for (let i = 0; i < allowedInputs.length; i++) {
+  for (let i = 0; i <= allowedInputs.length; i++) {
     if (parseInt(i) === allowedInputs.length - 1) {
       afterNonUniqueErrorMsg += 'or "' + allowedInputs[parseInt(i)] + '."'
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(5) ] to have the same members as [ …(3) ]

[Survived] BlockStatement
controllers/validators.js:124:50
 
   let afterNonUniqueErrorMsg = ""
 
-  for (let i = 0; i < allowedInputs.length; i++) {
-    if (parseInt(i) === allowedInputs.length - 1) {
-      afterNonUniqueErrorMsg += 'or "' + allowedInputs[parseInt(i)] + '."'
-      continue
-    }
-
-    afterNonUniqueErrorMsg += '"' + allowedInputs[parseInt(i)] + '", '
-  }
+  for (let i = 0; i < allowedInputs.length; i++) {}
 
   return body()

[Killed] EqualityOperator
controllers/validators.js:125:9
   let afterNonUniqueErrorMsg = ""
 
   for (let i = 0; i < allowedInputs.length; i++) {
-    if (parseInt(i) === allowedInputs.length - 1) {
+    if (parseInt(i) !== allowedInputs.length - 1) {
       afterNonUniqueErrorMsg += 'or "' + allowedInputs[parseInt(i)] + '."'
       continue
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Killed] ArithmeticOperator
controllers/validators.js:125:25
   let afterNonUniqueErrorMsg = ""
 
   for (let i = 0; i < allowedInputs.length; i++) {
-    if (parseInt(i) === allowedInputs.length - 1) {
+    if (parseInt(i) === allowedInputs.length + 1) {
       afterNonUniqueErrorMsg += 'or "' + allowedInputs[parseInt(i)] + '."'
       continue
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Survived] AssignmentOperator
controllers/validators.js:126:7
 
   for (let i = 0; i < allowedInputs.length; i++) {
     if (parseInt(i) === allowedInputs.length - 1) {
-      afterNonUniqueErrorMsg += 'or "' + allowedInputs[parseInt(i)] + '."'
+      afterNonUniqueErrorMsg -= 'or "' + allowedInputs[parseInt(i)] + '."'
       continue
     }

[Survived] AssignmentOperator
controllers/validators.js:130:5
       continue
     }
 
-    afterNonUniqueErrorMsg += '"' + allowedInputs[parseInt(i)] + '", '
+    afterNonUniqueErrorMsg -= '"' + allowedInputs[parseInt(i)] + '", '
   }
 

[NoCoverage] BlockStatement
controllers/validators.js:135:23
 
   return body()
     .optional()
-    .custom((body) => {
-      const requestBodyKeys = Object.keys(body)
-
-      const allowedInputsInBody = requestBodyKeys.filter((key) => {
-        return allowedInputs.includes(key)
-      })
-
-      const numberOfBodyAllowedInputs = allowedInputsInBody.length
-
-      if (numberOfBodyAllowedInputs <= 1) {
-        return true
-      }
-
-      if (numberOfBodyAllowedInputs > maxAllowedInputs) {
-        throw new Error(
-          `the request body object only allows ${maxAllowedInputs} or less than of the following: ` +
-            afterNonUniqueErrorMsg
-        )
-      }
-
-      if (isCaptionsRoute) return captionsMultiInputCheck(allowedInputsInBody)
-
-      return true
-    })
+    .custom((body) => {})
 }
 

[NoCoverage] MethodExpression
controllers/validators.js:138:35
     .custom((body) => {
       const requestBodyKeys = Object.keys(body)
 
-      const allowedInputsInBody = requestBodyKeys.filter((key) => {
-        return allowedInputs.includes(key)
-      })
+      const allowedInputsInBody = requestBodyKeys
 
       const numberOfBodyAllowedInputs = allowedInputsInBody.length

[NoCoverage] BlockStatement
controllers/validators.js:138:67
     .custom((body) => {
       const requestBodyKeys = Object.keys(body)
 
-      const allowedInputsInBody = requestBodyKeys.filter((key) => {
-        return allowedInputs.includes(key)
-      })
+      const allowedInputsInBody = requestBodyKeys.filter((key) => {})
 
       const numberOfBodyAllowedInputs = allowedInputsInBody.length

[NoCoverage] EqualityOperator
controllers/validators.js:144:11
 
       const numberOfBodyAllowedInputs = allowedInputsInBody.length
 
-      if (numberOfBodyAllowedInputs <= 1) {
+      if (numberOfBodyAllowedInputs > 1) {
         return true
       }

[NoCoverage] BlockStatement
controllers/validators.js:144:43
 
       const numberOfBodyAllowedInputs = allowedInputsInBody.length
 
-      if (numberOfBodyAllowedInputs <= 1) {
-        return true
-      }
+      if (numberOfBodyAllowedInputs <= 1) {}
 
       if (numberOfBodyAllowedInputs > maxAllowedInputs) {

[NoCoverage] BooleanLiteral
controllers/validators.js:145:16
       const numberOfBodyAllowedInputs = allowedInputsInBody.length
 
       if (numberOfBodyAllowedInputs <= 1) {
-        return true
+        return false
       }
 

[NoCoverage] BlockStatement
controllers/validators.js:148:57
         return true
       }
 
-      if (numberOfBodyAllowedInputs > maxAllowedInputs) {
-        throw new Error(
-          `the request body object only allows ${maxAllowedInputs} or less than of the following: ` +
-            afterNonUniqueErrorMsg
-        )
-      }
+      if (numberOfBodyAllowedInputs > maxAllowedInputs) {}
 
       if (isCaptionsRoute) return captionsMultiInputCheck(allowedInputsInBody)

[NoCoverage] EqualityOperator
controllers/validators.js:148:11
         return true
       }
 
-      if (numberOfBodyAllowedInputs > maxAllowedInputs) {
+      if (numberOfBodyAllowedInputs >= maxAllowedInputs) {
         throw new Error(
           `the request body object only allows ${maxAllowedInputs} or less than of the following: ` +

[NoCoverage] StringLiteral
controllers/validators.js:150:11
 
       if (numberOfBodyAllowedInputs > maxAllowedInputs) {
         throw new Error(
-          `the request body object only allows ${maxAllowedInputs} or less than of the following: ` +
+          `` +
             afterNonUniqueErrorMsg
         )

[Survived] ConditionalExpression
controllers/validators.js:155:11
         )
       }
 
-      if (isCaptionsRoute) return captionsMultiInputCheck(allowedInputsInBody)
+      if (false) return captionsMultiInputCheck(allowedInputsInBody)
 
       return true

[Survived] ConditionalExpression
controllers/validators.js:155:11
         )
       }
 
-      if (isCaptionsRoute) return captionsMultiInputCheck(allowedInputsInBody)
+      if (true) return captionsMultiInputCheck(allowedInputsInBody)
 
       return true

[NoCoverage] BlockStatement
controllers/validators.js:161:55
     })
 }
 
-exports.validationPerusal = (request, preErrorMsg) => {
-  const validationError = validationResult(request).array({
-    onlyFirstError: true,
-  })[0]
-
-  if (validationError) {
-    throw new Api400Error(preErrorMsg + " " + validationError.msg)
-  }
-
-  return matchedData(request)
-}
+exports.validationPerusal = (request, preErrorMsg) => {}
 
 exports.credentialsValidator = () => {

[NoCoverage] ObjectLiteral
controllers/validators.js:162:59
 }
 
 exports.validationPerusal = (request, preErrorMsg) => {
-  const validationError = validationResult(request).array({
-    onlyFirstError: true,
-  })[0]
+  const validationError = validationResult(request).array({})[0]
 
   if (validationError) {

[NoCoverage] BooleanLiteral
controllers/validators.js:163:21
 
 exports.validationPerusal = (request, preErrorMsg) => {
   const validationError = validationResult(request).array({
-    onlyFirstError: true,
+    onlyFirstError: false,
   })[0]
 

[Killed] ArrayDeclaration
controllers/validators.js:174:10
 }
 
 exports.credentialsValidator = () => {
-  return [usernameValidator(), passwordValidator()]
+  return []
 }
 
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(6) ] to have the same members as [ …(3) ]

[Survived] BooleanLiteral
controllers/validators.js:179:45
 
 exports.newCredentialsValidator = () => {
   return [
-    usernameValidator("newUsername", false, true),
+    usernameValidator("newUsername", false, false),
     passwordValidator("newPassword", false, true),
   ]

[Survived] BooleanLiteral
controllers/validators.js:179:38
 
 exports.newCredentialsValidator = () => {
   return [
-    usernameValidator("newUsername", false, true),
+    usernameValidator("newUsername", true, true),
     passwordValidator("newPassword", false, true),
   ]

[Killed] BooleanLiteral
controllers/validators.js:180:45
 exports.newCredentialsValidator = () => {
   return [
     usernameValidator("newUsername", false, true),
-    passwordValidator("newPassword", false, true),
+    passwordValidator("newPassword", false, false),
   ]
 }
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Survived] BooleanLiteral
controllers/validators.js:180:38
 exports.newCredentialsValidator = () => {
   return [
     usernameValidator("newUsername", false, true),
-    passwordValidator("newPassword", false, true),
+    passwordValidator("newPassword", true, true),
   ]
 }

[Survived] BooleanLiteral
controllers/validators.js:190:35
 
 exports.getPhotosValidator = () => {
   return [
-    textValidator("title", false, true),
+    textValidator("title", false, false),
     integerValidator("userId", false, true),
     allowedBodyInputsValidator(["title", "userId"], false, 1),

[Survived] BooleanLiteral
controllers/validators.js:190:28
 
 exports.getPhotosValidator = () => {
   return [
-    textValidator("title", false, true),
+    textValidator("title", true, true),
     integerValidator("userId", false, true),
     allowedBodyInputsValidator(["title", "userId"], false, 1),

[Killed] BooleanLiteral
controllers/validators.js:191:32
 exports.getPhotosValidator = () => {
   return [
     textValidator("title", false, true),
-    integerValidator("userId", false, true),
+    integerValidator("userId", true, true),
     allowedBodyInputsValidator(["title", "userId"], false, 1),
   ]
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Killed] BooleanLiteral
controllers/validators.js:191:39
 exports.getPhotosValidator = () => {
   return [
     textValidator("title", false, true),
-    integerValidator("userId", false, true),
+    integerValidator("userId", false, false),
     allowedBodyInputsValidator(["title", "userId"], false, 1),
   ]
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Survived] BooleanLiteral
controllers/validators.js:192:53
   return [
     textValidator("title", false, true),
     integerValidator("userId", false, true),
-    allowedBodyInputsValidator(["title", "userId"], false, 1),
+    allowedBodyInputsValidator(["title", "userId"], true, 1),
   ]
 }

[Survived] BooleanLiteral
controllers/validators.js:197:45
 }
 
 exports.deletePhotosValidator = () => {
-  return [integerValidator("userId", false, true)]
+  return [integerValidator("userId", false, false)]
 }
 

[Survived] BooleanLiteral
controllers/validators.js:197:38
 }
 
 exports.deletePhotosValidator = () => {
-  return [integerValidator("userId", false, true)]
+  return [integerValidator("userId", true, true)]
 }
 

[Killed] ArrayDeclaration
controllers/validators.js:205:10
 }
 
 exports.getCaptionsValidator = () => {
-  return [
-    integerValidator("userId", false, true),
-    integerValidator("photoId", false, true),
-    allowedBodyInputsValidator(["userId", "photoId"], true, 2),
-  ]
+  return []
 }
 
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Killed] BooleanLiteral
controllers/validators.js:206:32
 
 exports.getCaptionsValidator = () => {
   return [
-    integerValidator("userId", false, true),
+    integerValidator("userId", true, true),
     integerValidator("photoId", false, true),
     allowedBodyInputsValidator(["userId", "photoId"], true, 2),
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(5) ] to have the same members as [ …(3) ]

[Survived] BooleanLiteral
controllers/validators.js:206:39
 
 exports.getCaptionsValidator = () => {
   return [
-    integerValidator("userId", false, true),
+    integerValidator("userId", false, false),
     integerValidator("photoId", false, true),
     allowedBodyInputsValidator(["userId", "photoId"], true, 2),

[Survived] BooleanLiteral
controllers/validators.js:207:40
 exports.getCaptionsValidator = () => {
   return [
     integerValidator("userId", false, true),
-    integerValidator("photoId", false, true),
+    integerValidator("photoId", false, false),
     allowedBodyInputsValidator(["userId", "photoId"], true, 2),
   ]

[Survived] BooleanLiteral
controllers/validators.js:207:33
 exports.getCaptionsValidator = () => {
   return [
     integerValidator("userId", false, true),
-    integerValidator("photoId", false, true),
+    integerValidator("photoId", true, true),
     allowedBodyInputsValidator(["userId", "photoId"], true, 2),
   ]

[Killed] BooleanLiteral
controllers/validators.js:208:55
   return [
     integerValidator("userId", false, true),
     integerValidator("photoId", false, true),
-    allowedBodyInputsValidator(["userId", "photoId"], true, 2),
+    allowedBodyInputsValidator(["userId", "photoId"], false, 2),
   ]
 }
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(5) ] to have the same members as [ …(3) ]

[Killed] StringLiteral
controllers/validators.js:208:33
   return [
     integerValidator("userId", false, true),
     integerValidator("photoId", false, true),
-    allowedBodyInputsValidator(["userId", "photoId"], true, 2),
+    allowedBodyInputsValidator(["", "photoId"], true, 2),
   ]
 }
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(5) ] to have the same members as [ …(3) ]

[Survived] ArrayDeclaration
controllers/validators.js:213:10
 }
 
 exports.deleteCaptionsValidator = () => {
-  return [
-    integerValidator("userId", false, true),
-    integerValidator("photoId", false, true),
-    allowedBodyInputsValidator(["userId", "photoId"], true, 2),
-  ]
+  return []
 }
 

[Survived] StringLiteral
controllers/validators.js:216:43
   return [
     integerValidator("userId", false, true),
     integerValidator("photoId", false, true),
-    allowedBodyInputsValidator(["userId", "photoId"], true, 2),
+    allowedBodyInputsValidator(["userId", ""], true, 2),
   ]
 }
