[NoCoverage] BooleanLiteral
util/apiErrors.js:9:21
     description,
     statusCode = httpStatusCodes.BAD_REQUEST,
     name = "Bad request.",
-    isOperational = true
+    isOperational = false
   ) {
     super(description, statusCode, name, isOperational)

[NoCoverage] BlockStatement
util/apiErrors.js:10:5
     statusCode = httpStatusCodes.BAD_REQUEST,
     name = "Bad request.",
     isOperational = true
-  ) {
-    super(description, statusCode, name, isOperational)
-  }
+  ) {}
 }
 

[NoCoverage] StringLiteral
util/apiErrors.js:19:12
   constructor(
     description,
     statusCode = httpStatusCodes.UNAUTHORIZED,
-    name = "Unauthorized.",
+    name = "",
     isOperational = true
   ) {

[Survived] BooleanLiteral
util/apiErrors.js:20:21
     description,
     statusCode = httpStatusCodes.UNAUTHORIZED,
     name = "Unauthorized.",
-    isOperational = true
+    isOperational = false
   ) {
     super(description, statusCode, name, isOperational)

[NoCoverage] BooleanLiteral
util/apiErrors.js:53:21
     description,
     statusCode = httpStatusCodes.INTERNAL_SERVER_ERROR,
     name = "Internal server error.",
-    isOperational = false
+    isOperational = true
   ) {
     super(description, statusCode, name, isOperational)

[Survived] BlockStatement
util/apiErrors.js:54:5
     statusCode = httpStatusCodes.INTERNAL_SERVER_ERROR,
     name = "Internal server error.",
     isOperational = false
-  ) {
-    super(description, statusCode, name, isOperational)
-  }
+  ) {}
 }
 
