[Survived] ArrayDeclaration
controllers/users.js:19:10
       limit: 10,
     },
   ],
-  order: [["id", "DESC"]],
+  order: [],
 }
 

[Timeout] BlockStatement
controllers/users.js:25:7
 exports.paramUsername = async (req, res, next, username) => {
   const user = req.session.user
 
-  try {
-    await usernameValidator("username", true).run(req)
-
-    validationPerusal(req, `User: ${user.id}`)
-
-    const searched = await models.User.findOne({
-      where: { username: username },
-      ...otherOptions,
-    })
-
-    if (!searched) {
-      throw new Api404Error(
-        `User: ${user.id} target username ${username} not found.`
-      )
-    }
-
-    req.targetUser = searched.dataValues
-
-    next()
-  } catch (err) {
+  try {} catch (err) {
     next(err)
   }

[NoCoverage] BooleanLiteral
controllers/users.js:26:41
   const user = req.session.user
 
   try {
-    await usernameValidator("username", true).run(req)
+    await usernameValidator("username", false).run(req)
 
     validationPerusal(req, `User: ${user.id}`)

[NoCoverage] StringLiteral
controllers/users.js:26:29
   const user = req.session.user
 
   try {
-    await usernameValidator("username", true).run(req)
+    await usernameValidator("", true).run(req)
 
     validationPerusal(req, `User: ${user.id}`)

[NoCoverage] ObjectLiteral
controllers/users.js:31:14
     validationPerusal(req, `User: ${user.id}`)
 
     const searched = await models.User.findOne({
-      where: { username: username },
+      where: {},
       ...otherOptions,
     })

[Timeout] BlockStatement
controllers/users.js:49:46
   }
 }
 
-exports.getUsers = async (req, res, next) => {
-  try {
-    const searched = await models.User.findAll({
-      ...otherOptions,
-    })
-
-    res.json(searched)
-  } catch (err) {
-    next(err)
-  }
-}
+exports.getUsers = async (req, res, next) => {}
 
 exports.getUser = async (req, res) => {

[Timeout] BlockStatement
controllers/users.js:50:7
 }
 
 exports.getUsers = async (req, res, next) => {
-  try {
-    const searched = await models.User.findAll({
-      ...otherOptions,
-    })
-
-    res.json(searched)
-  } catch (err) {
+  try {} catch (err) {
     next(err)
   }

[Timeout] BlockStatement
controllers/users.js:61:39
   }
 }
 
-exports.getUser = async (req, res) => {
-  const targetUser = req.targetUser
-
-  res.json(targetUser)
-}
+exports.getUser = async (req, res) => {}
 
 exports.putUser = async (req, res, next) => {

[Survived] StringLiteral
controllers/users.js:72:28
   const saltRounds = 10
 
   try {
-    validationPerusal(req, `User: ${user.id}`)
+    validationPerusal(req, ``)
 
     const { username, password, newUsername, newPassword } = req.body

[NoCoverage] ConditionalExpression
controllers/users.js:76:9
 
     const { username, password, newUsername, newPassword } = req.body
 
-    if (!newUsername && !newPassword) {
+    if (false) {
       throw new Api400Error(`User: ${user.id} did not update any values.`)
     }

[NoCoverage] BooleanLiteral
controllers/users.js:76:9
 
     const { username, password, newUsername, newPassword } = req.body
 
-    if (!newUsername && !newPassword) {
+    if (newUsername && !newPassword) {
       throw new Api400Error(`User: ${user.id} did not update any values.`)
     }

[NoCoverage] BlockStatement
controllers/users.js:80:22
       throw new Api400Error(`User: ${user.id} did not update any values.`)
     }
 
-    if (newUsername) {
-      const searched = await models.User.findOne({
-        where: { username: newUsername },
-      })
-
-      if (searched) {
-        throw new Api400Error(
-          `User: ${user.id} new username, ${newUsername}, is already in use.`
-        )
-      }
-    }
+    if (newUsername) {}
 
     await authenticate(username, password)

[NoCoverage] ConditionalExpression
controllers/users.js:80:9
       throw new Api400Error(`User: ${user.id} did not update any values.`)
     }
 
-    if (newUsername) {
+    if (false) {
       const searched = await models.User.findOne({
         where: { username: newUsername },

[NoCoverage] ConditionalExpression
controllers/users.js:85:11
         where: { username: newUsername },
       })
 
-      if (searched) {
+      if (false) {
         throw new Api400Error(
           `User: ${user.id} new username, ${newUsername}, is already in use.`

[NoCoverage] BlockStatement
controllers/users.js:85:21
         where: { username: newUsername },
       })
 
-      if (searched) {
-        throw new Api400Error(
-          `User: ${user.id} new username, ${newUsername}, is already in use.`
-        )
-      }
+      if (searched) {}
     }
 

[NoCoverage] ConditionalExpression
controllers/users.js:98:9
 
     updatedValues.username = newUsername
 
-    if (newPassword) {
+    if (false) {
       const hashedNewPassword = await passwordHash(newPassword, saltRounds)
 

[NoCoverage] ConditionalExpression
controllers/users.js:98:9
 
     updatedValues.username = newUsername
 
-    if (newPassword) {
+    if (true) {
       const hashedNewPassword = await passwordHash(newPassword, saltRounds)
 

[NoCoverage] ObjectLiteral
controllers/users.js:105:14
     }
 
     const updated = await models.User.update(updatedValues, {
-      where: { id: user.id },
+      where: {},
     })
 

[NoCoverage] BlockStatement
controllers/users.js:108:19
       where: { id: user.id },
     })
 
-    if (!updated) {
-      throw new Api500Error(`User: ${user.id} update user query did not work.`)
-    }
+    if (!updated) {}
 
     res.send(

[NoCoverage] ConditionalExpression
controllers/users.js:123:24
 exports.deleteUser = async (req, res, next) => {
   const user = req.session.user
   const targetUser = req.targetUser
-  const targetIsSelf = user.id === targetUser.id
+  const targetIsSelf = false
   const responseMsg = targetIsSelf
     ? `User: ${user.id} has deleted their own account.`

[NoCoverage] EqualityOperator
controllers/users.js:123:24
 exports.deleteUser = async (req, res, next) => {
   const user = req.session.user
   const targetUser = req.targetUser
-  const targetIsSelf = user.id === targetUser.id
+  const targetIsSelf = user.id !== targetUser.id
   const responseMsg = targetIsSelf
     ? `User: ${user.id} has deleted their own account.`

[NoCoverage] StringLiteral
controllers/users.js:126:7
   const targetIsSelf = user.id === targetUser.id
   const responseMsg = targetIsSelf
     ? `User: ${user.id} has deleted their own account.`
-    : `User: ${user.id} has deleted user ${targetUser.id}.`
+    : ``
 
   try {

[NoCoverage] BooleanLiteral
controllers/users.js:129:26
     : `User: ${user.id} has deleted user ${targetUser.id}.`
 
   try {
-    if (!targetIsSelf && !user.isAdmin) {
+    if (!targetIsSelf && user.isAdmin) {
       throw new Api403Error(
         `User: ${user.id} is not authorized to delete a user.`

[Survived] StringLiteral
controllers/users.js:131:9
   try {
     if (!targetIsSelf && !user.isAdmin) {
       throw new Api403Error(
-        `User: ${user.id} is not authorized to delete a user.`
+        ``
       )
     }

[NoCoverage] ObjectLiteral
controllers/users.js:141:47
 
     await authenticate(username, password)
 
-    const deleted = await models.User.destroy({
-      where: {
-        id: targetUser.id,
-        isAdmin: false,
-      },
-    })
+    const deleted = await models.User.destroy({})
 
     if (!deleted) {

[NoCoverage] ObjectLiteral
controllers/users.js:142:14
     await authenticate(username, password)
 
     const deleted = await models.User.destroy({
-      where: {
-        id: targetUser.id,
-        isAdmin: false,
-      },
+      where: {},
     })
 

[NoCoverage] BooleanLiteral
controllers/users.js:144:18
     const deleted = await models.User.destroy({
       where: {
         id: targetUser.id,
-        isAdmin: false,
+        isAdmin: true,
       },
     })

[NoCoverage] StringLiteral
controllers/users.js:150:9
 
     if (!deleted) {
       throw new Api500Error(
-        `User: ${user.id} delete a user query did not work because query went wrong or the target user is an admin.`
+        ``
       )
     }

[NoCoverage] ConditionalExpression
controllers/users.js:154:9
       )
     }
 
-    if (targetIsSelf) {
+    if (true) {
       req.session.authorized = false
 

[NoCoverage] BlockStatement
controllers/users.js:154:23
       )
     }
 
-    if (targetIsSelf) {
-      req.session.authorized = false
-
-      generateToken(req, res, true)
-    }
+    if (targetIsSelf) {}
 
     res.send(responseMsg)

[NoCoverage] BooleanLiteral
controllers/users.js:155:32
     }
 
     if (targetIsSelf) {
-      req.session.authorized = false
+      req.session.authorized = true
 
       generateToken(req, res, true)
