[NoCoverage] BlockStatement
util/baseError.js:2:61
 class BaseError extends Error {
-  constructor(description, statusCode, name, isOperational) {
-    super(name)
-
-    Object.setPrototypeOf(this, new.target.prototype)
-    this.description = description
-    this.statusCode = statusCode
-    this.isOperational = isOperational
-    Error.captureStackTrace(this)
-  }
+  constructor(description, statusCode, name, isOperational) {}
 }
 
