[NoCoverage] BlockStatement
util/authenticate.js:5:44
 const models = require("../database/models")
 const { Api401Error } = require("./apiErrors")
 
-const usernameExists = async (username) => {
-  const user = await models.User.findOne({
-    where: {
-      username,
-    },
-  })
-
-  if (!user) {
-    throw new Api401Error(`Client: username ${username} not found.`)
-  }
-
-  return user.dataValues
-}
+const usernameExists = async (username) => {}
 
 const correctPassword = async (user, password) => {

[NoCoverage] ObjectLiteral
util/authenticate.js:6:42
 const { Api401Error } = require("./apiErrors")
 
 const usernameExists = async (username) => {
-  const user = await models.User.findOne({
-    where: {
-      username,
-    },
-  })
+  const user = await models.User.findOne({})
 
   if (!user) {

[NoCoverage] BlockStatement
util/authenticate.js:19:51
   return user.dataValues
 }
 
-const correctPassword = async (user, password) => {
-  const passwordsMatch = await bcrypt.compare(password, user.password)
-
-  if (!passwordsMatch) {
-    throw new Api401Error(
-      `Client: with chosen user id ${user.id} has input an incorrect password.`
-    )
-  }
-}
+const correctPassword = async (user, password) => {}
 
 const authenticate = async (username, password) => {

[NoCoverage] ConditionalExpression
util/authenticate.js:22:7
 const correctPassword = async (user, password) => {
   const passwordsMatch = await bcrypt.compare(password, user.password)
 
-  if (!passwordsMatch) {
+  if (true) {
     throw new Api401Error(
       `Client: with chosen user id ${user.id} has input an incorrect password.`

[NoCoverage] ConditionalExpression
util/authenticate.js:22:7
 const correctPassword = async (user, password) => {
   const passwordsMatch = await bcrypt.compare(password, user.password)
 
-  if (!passwordsMatch) {
+  if (false) {
     throw new Api401Error(
       `Client: with chosen user id ${user.id} has input an incorrect password.`

[NoCoverage] BlockStatement
util/authenticate.js:29:52
   }
 }
 
-const authenticate = async (username, password) => {
-  const user = await usernameExists(username)
-
-  await correctPassword(user, password)
-
-  return user
-}
+const authenticate = async (username, password) => {}
 
 module.exports = { usernameExists, correctPassword, authenticate }
