[NoCoverage] BlockStatement
util/passwordHash.js:3:56
 const bcrypt = require("bcrypt")
 
-exports.passwordHash = async (password, saltRounds) => {
-  const salt = await bcrypt.genSalt(saltRounds)
-  return await bcrypt.hash(password, salt)
-}
+exports.passwordHash = async (password, saltRounds) => {}
 
