[NoCoverage] BlockStatement
util/httpLogger.js:10:38
 //   contentLength: ":res[content-length]",
 //   responseTime: ":response-time",
 // })
-const format = (tokens, req, res) => {
-  return JSON.stringify({
-    method: tokens.method(req, res),
-    url: tokens.url(req, res),
-    status: tokens.status(req, res),
-    contentLength: tokens.res(req, res, "content-length"),
-    responseTime: tokens["response-time"](req, res),
-  })
-}
+const format = (tokens, req, res) => {}
 
 const logger = require("./logger")

[NoCoverage] ObjectLiteral
util/httpLogger.js:11:25
 //   responseTime: ":response-time",
 // })
 const format = (tokens, req, res) => {
-  return JSON.stringify({
-    method: tokens.method(req, res),
-    url: tokens.url(req, res),
-    status: tokens.status(req, res),
-    contentLength: tokens.res(req, res, "content-length"),
-    responseTime: tokens["response-time"](req, res),
-  })
+  return JSON.stringify({})
 }
 

[NoCoverage] StringLiteral
util/httpLogger.js:15:41
     method: tokens.method(req, res),
     url: tokens.url(req, res),
     status: tokens.status(req, res),
-    contentLength: tokens.res(req, res, "content-length"),
+    contentLength: tokens.res(req, res, ""),
     responseTime: tokens["response-time"](req, res),
   })

[NoCoverage] BlockStatement
util/httpLogger.js:23:25
 const logger = require("./logger")
 const httpLogger = morgan(format, {
   stream: {
-    write: (message) => {
-      const { method, url, status, contentLength, responseTime } =
-        JSON.parse(message)
-
-      logger.info("HTTP Access Log", {
-        timestamp: new Date().toString(),
-        method,
-        url,
-        status: Number(status),
-        contentLength,
-        responseTime: Number(responseTime),
-      })
-    },
+    write: (message) => {},
   },
 })
