[Survived] ArrowFunction
util/doubleCsrf.js:6:16
 
 const { invalidCsrfTokenError, generateToken, doubleCsrfProtection } =
   doubleCsrf({
-    getSecret: (req) => req.secret,
+    getSecret: () => undefined,
     secret: process.env.CSRF_SECRET,
     cookieOptions: {

[Survived] StringLiteral
util/doubleCsrf.js:9:17
     getSecret: (req) => req.secret,
     secret: process.env.CSRF_SECRET,
     cookieOptions: {
-      sameSite: "strict",
+      sameSite: "",
       secure: process.env.NODE_ENV === "production", //set this like this becuase the app I am munually testing endpoints on can only save the cookies if they are secure
       signed: true,

[Killed] EqualityOperator
util/doubleCsrf.js:10:15
     secret: process.env.CSRF_SECRET,
     cookieOptions: {
       sameSite: "strict",
-      secure: process.env.NODE_ENV === "production", //set this like this becuase the app I am munually testing endpoints on can only save the cookies if they are secure
+      secure: process.env.NODE_ENV !== "production", //set this like this becuase the app I am munually testing endpoints on can only save the cookies if they are secure
       signed: true,
       maxAge: 1000 * 60 * 30,
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(7) ] to have the same members as [ …(3) ]

[Survived] ConditionalExpression
util/doubleCsrf.js:10:15
     secret: process.env.CSRF_SECRET,
     cookieOptions: {
       sameSite: "strict",
-      secure: process.env.NODE_ENV === "production", //set this like this becuase the app I am munually testing endpoints on can only save the cookies if they are secure
+      secure: true, //set this like this becuase the app I am munually testing endpoints on can only save the cookies if they are secure
       signed: true,
       maxAge: 1000 * 60 * 30,

[Survived] BooleanLiteral
util/doubleCsrf.js:11:15
     cookieOptions: {
       sameSite: "strict",
       secure: process.env.NODE_ENV === "production", //set this like this becuase the app I am munually testing endpoints on can only save the cookies if they are secure
-      signed: true,
+      signed: false,
       maxAge: 1000 * 60 * 30,
     },

[Survived] ArithmeticOperator
util/doubleCsrf.js:12:15
       sameSite: "strict",
       secure: process.env.NODE_ENV === "production", //set this like this becuase the app I am munually testing endpoints on can only save the cookies if they are secure
       signed: true,
-      maxAge: 1000 * 60 * 30,
+      maxAge: 1000 / 60 * 30,
     },
   })

[Survived] ArithmeticOperator
util/doubleCsrf.js:12:15
       sameSite: "strict",
       secure: process.env.NODE_ENV === "production", //set this like this becuase the app I am munually testing endpoints on can only save the cookies if they are secure
       signed: true,
-      maxAge: 1000 * 60 * 30,
+      maxAge: 1000 * 60 / 30,
     },
   })

[Killed] ConditionalExpression
util/doubleCsrf.js:15:33
       maxAge: 1000 * 60 * 30,
     },
   })
-console.log("secure cookies: ", process.env.NODE_ENV === "production")
+console.log("secure cookies: ", true)
 module.exports = {
   invalidCsrfTokenError,
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Killed] EqualityOperator
util/doubleCsrf.js:15:33
       maxAge: 1000 * 60 * 30,
     },
   })
-console.log("secure cookies: ", process.env.NODE_ENV === "production")
+console.log("secure cookies: ", process.env.NODE_ENV !== "production")
 module.exports = {
   invalidCsrfTokenError,
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]
