[Killed] BlockStatement
util/search.js:1:37
-const sentenceCase = (camelCase) => {
-  const result = camelCase.replace(/([A-Z])/g, " $1")
-  return result[0].toUpperCase() + result.substring(1).toLowerCase()
-}
+const sentenceCase = (camelCase) => {}
 
 exports.sentenceCase = sentenceCase
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Killed] MethodExpression
util/search.js:3:36
 const sentenceCase = (camelCase) => {
   const result = camelCase.replace(/([A-Z])/g, " $1")
-  return result[0].toUpperCase() + result.substring(1).toLowerCase()
+  return result[0].toUpperCase() + result.toLowerCase()
 }
 
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Killed] ArithmeticOperator
util/search.js:3:10
 const sentenceCase = (camelCase) => {
   const result = camelCase.replace(/([A-Z])/g, " $1")
-  return result[0].toUpperCase() + result.substring(1).toLowerCase()
+  return result[0].toUpperCase() - result.substring(1).toLowerCase()
 }
 
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Survived] ObjectLiteral
util/search.js:9:19
 exports.sentenceCase = sentenceCase
 
 const selfSearch = (userId) => {
-  return { where: { userId: userId } }
+  return { where: {} }
 }
 

[NoCoverage] BlockStatement
util/search.js:14:52
 
 exports.selfSearch = selfSearch
 
-const whereSearch = (whereOption, otherOptions) => {
-  return {
-    where: whereOption,
-    ...otherOptions,
-  }
-}
+const whereSearch = (whereOption, otherOptions) => {}
 
 exports.whereSearch = whereSearch

[NoCoverage] ObjectLiteral
util/search.js:25:31
 
 const inputsToSearch = (req, defaultSearch, otherOptions) => {
   const { userId, photoId } = req.body
-  const inputs = [{ userId }, { photoId }]
+  const inputs = [{ userId }, {}]
 
   let searchParams = defaultSearch

[NoCoverage] BlockStatement
util/search.js:30:48
   let searchParams = defaultSearch
   let afterMsg = "."
 
-  let definedInputs = inputs.filter((input) => {
-    return Object.values(input)[0] !== undefined
-  })
+  let definedInputs = inputs.filter((input) => {})
 
   if (definedInputs.length === 0) {

[NoCoverage] MethodExpression
util/search.js:30:23
   let searchParams = defaultSearch
   let afterMsg = "."
 
-  let definedInputs = inputs.filter((input) => {
-    return Object.values(input)[0] !== undefined
-  })
+  let definedInputs = inputs
 
   if (definedInputs.length === 0) {

[NoCoverage] ConditionalExpression
util/search.js:31:12
   let afterMsg = "."
 
   let definedInputs = inputs.filter((input) => {
-    return Object.values(input)[0] !== undefined
+    return false
   })
 

[NoCoverage] EqualityOperator
util/search.js:31:12
   let afterMsg = "."
 
   let definedInputs = inputs.filter((input) => {
-    return Object.values(input)[0] !== undefined
+    return Object.values(input)[0] === undefined
   })
 

[NoCoverage] ConditionalExpression
util/search.js:34:7
     return Object.values(input)[0] !== undefined
   })
 
-  if (definedInputs.length === 0) {
+  if (false) {
     return { afterMsg, searchParams }
   }

[NoCoverage] ConditionalExpression
util/search.js:34:7
     return Object.values(input)[0] !== undefined
   })
 
-  if (definedInputs.length === 0) {
+  if (true) {
     return { afterMsg, searchParams }
   }

[NoCoverage] ArrowFunction
util/search.js:39:5
   }
 
   definedInputs = definedInputs.reduce(
-    (obj, item) => ({
-      ...obj,
-      ...item,
-    }),
+    () => undefined,
     {}
   )

[NoCoverage] ObjectLiteral
util/search.js:39:21
   }
 
   definedInputs = definedInputs.reduce(
-    (obj, item) => ({
-      ...obj,
-      ...item,
-    }),
+    (obj, item) => ({}),
     {}
   )

[NoCoverage] EqualityOperator
util/search.js:55:7
   inputKeys.shift()
   inputValues.shift()
 
-  if (Object.keys(definedInputs).length === 2) {
+  if (Object.keys(definedInputs).length !== 2) {
     afterMsg =
       afterMsg.substring(0, afterMsg.length - 1) +

[NoCoverage] ConditionalExpression
util/search.js:55:7
   inputKeys.shift()
   inputValues.shift()
 
-  if (Object.keys(definedInputs).length === 2) {
+  if (true) {
     afterMsg =
       afterMsg.substring(0, afterMsg.length - 1) +

[NoCoverage] ArithmeticOperator
util/search.js:57:29
 
   if (Object.keys(definedInputs).length === 2) {
     afterMsg =
-      afterMsg.substring(0, afterMsg.length - 1) +
+      afterMsg.substring(0, afterMsg.length + 1) +
       ", and " +
       sentenceCase(inputKeys[0]) +

[NoCoverage] MethodExpression
util/search.js:57:7
 
   if (Object.keys(definedInputs).length === 2) {
     afterMsg =
-      afterMsg.substring(0, afterMsg.length - 1) +
+      afterMsg +
       ", and " +
       sentenceCase(inputKeys[0]) +

[NoCoverage] StringLiteral
util/search.js:58:7
   if (Object.keys(definedInputs).length === 2) {
     afterMsg =
       afterMsg.substring(0, afterMsg.length - 1) +
-      ", and " +
+      "" +
       sentenceCase(inputKeys[0]) +
       `= ${inputValues[0]}.`

[NoCoverage] StringLiteral
util/search.js:60:7
       afterMsg.substring(0, afterMsg.length - 1) +
       ", and " +
       sentenceCase(inputKeys[0]) +
-      `= ${inputValues[0]}.`
+      ``
   }
 
