[Timeout] BlockStatement
routes/index.js:18:31
 const { Router } = require("express")
 const router = Router()
 
-router.get("/", (req, res) => {
-  res.send("Welcome to the social media app Caption!!")
-})
+router.get("/", (req, res) => {})
 
 router.use("/login", loginRouter)

[Killed] StringLiteral
routes/index.js:19:12
 const router = Router()
 
 router.get("/", (req, res) => {
-  res.send("Welcome to the social media app Caption!!")
+  res.send("")
 })
 
killedBy: Starting page / When request is made for the starting page, then response is ok with a message
statusReason: expected '' to equal 'Welcome to the social media app Capti…'

[Killed] StringLiteral
routes/index.js:29:12
 router.use(doubleCsrfProtection)
 
 router.use("/captions", captionsRouter)
-router.use("/photos", photosRouter)
+router.use("", photosRouter)
 router.use("/users", usersRouter)
 router.use("/logout", logoutRouter)
killedBy: Logout routes Get / When valid request is made, then response is ok
statusReason: expected 400 to equal 200

[NoCoverage] BlockStatement
routes/index.js:35:43
 
 router.use(logErrorMiddleware, returnError)
 
-process.on("unhandledRejection", (err) => {
-  throw err
-})
+process.on("unhandledRejection", (err) => {})
 
 process.on("uncaughtException", (err) => {

[NoCoverage] BlockStatement
routes/index.js:39:42
   throw err
 })
 
-process.on("uncaughtException", (err) => {
-  logError(err)
-
-  if (!isOperationalError(err)) {
-    process.exit(1)
-  }
-})
+process.on("uncaughtException", (err) => {})
 
 module.exports = router

[NoCoverage] ConditionalExpression
routes/index.js:42:7
 process.on("uncaughtException", (err) => {
   logError(err)
 
-  if (!isOperationalError(err)) {
+  if (true) {
     process.exit(1)
   }

[NoCoverage] BlockStatement
routes/index.js:42:33
 process.on("uncaughtException", (err) => {
   logError(err)
 
-  if (!isOperationalError(err)) {
-    process.exit(1)
-  }
+  if (!isOperationalError(err)) {}
 })
 
