[Killed] BooleanLiteral
server/index.js:17:40
 
 app.use(express.json())
 
-app.use(express.urlencoded({ extended: true }))
+app.use(express.urlencoded({ extended: false }))
 
 app.use(express.static("public"))
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(5) ] to have the same members as [ …(3) ]

[Killed] ObjectLiteral
server/index.js:22:11
 app.use(express.static("public"))
 
 app.use(
-  session({
-    secret: process.env.COOKIES_SECRET,
-    resave: true,
-    saveUninitialized: true,
-    cookie: {
-      maxAge: 1000 * 60 * 30,
-      secure: process.env.NODE_ENV === "production",
-      httpOnly: true,
-    },
-  })
+  session({})
 )
 
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Killed] BooleanLiteral
server/index.js:24:13
 app.use(
   session({
     secret: process.env.COOKIES_SECRET,
-    resave: true,
+    resave: false,
     saveUninitialized: true,
     cookie: {
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(5) ] to have the same members as [ …(3) ]

[Killed] BooleanLiteral
server/index.js:25:24
   session({
     secret: process.env.COOKIES_SECRET,
     resave: true,
-    saveUninitialized: true,
+    saveUninitialized: false,
     cookie: {
       maxAge: 1000 * 60 * 30,
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(5) ] to have the same members as [ …(3) ]

[Survived] ArithmeticOperator
server/index.js:27:15
     resave: true,
     saveUninitialized: true,
     cookie: {
-      maxAge: 1000 * 60 * 30,
+      maxAge: 1000 / 60 * 30,
       secure: process.env.NODE_ENV === "production",
       httpOnly: true,

[Survived] ArithmeticOperator
server/index.js:27:15
     resave: true,
     saveUninitialized: true,
     cookie: {
-      maxAge: 1000 * 60 * 30,
+      maxAge: 1000 * 60 / 30,
       secure: process.env.NODE_ENV === "production",
       httpOnly: true,

[Survived] ConditionalExpression
server/index.js:28:15
     saveUninitialized: true,
     cookie: {
       maxAge: 1000 * 60 * 30,
-      secure: process.env.NODE_ENV === "production",
+      secure: false,
       httpOnly: true,
     },

[Survived] ConditionalExpression
server/index.js:28:15
     saveUninitialized: true,
     cookie: {
       maxAge: 1000 * 60 * 30,
-      secure: process.env.NODE_ENV === "production",
+      secure: true,
       httpOnly: true,
     },

[Survived] BooleanLiteral
server/index.js:29:17
     cookie: {
       maxAge: 1000 * 60 * 30,
       secure: process.env.NODE_ENV === "production",
-      httpOnly: true,
+      httpOnly: false,
     },
   })

[Survived] BooleanLiteral
server/index.js:38:29
 
 app.use(helmet())
 
-app.use(cors({ credentials: true }))
+app.use(cors({ credentials: false }))
 
 app.use("/", routes)
