[Killed] StringLiteral
routes/login.js:6:17
 const { loginControllers } = require("../controllers/index")
 const { credentialsValidator } = require("../controllers/index").validators
 
-loginRouter.get("/", loginControllers.getLogin)
+loginRouter.get("", loginControllers.getLogin)
 
 loginRouter.post("/", credentialsValidator(), loginControllers.postLogin)
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 782, username: 'username', …(4) } to have property 'id' of 4, but got 782
