[NoCoverage] BlockStatement
s3/index.js:58:42
 
 exports.getFileStream = getFileStream
 
-const getObjectData = async (fileKey) => {
-  try {
-    const response = await getFileStream(fileKey)
-
-    const str = await response.Body.transformToString()
-
-    return str
-  } catch (err) {
-    return null
-  }
-}
+const getObjectData = async (fileKey) => {}
 
 exports.getObjectData = getObjectData

[NoCoverage] BlockStatement
s3/index.js:59:7
 exports.getFileStream = getFileStream
 
 const getObjectData = async (fileKey) => {
-  try {
-    const response = await getFileStream(fileKey)
-
-    const str = await response.Body.transformToString()
-
-    return str
-  } catch (err) {
+  try {} catch (err) {
     return null
   }

[NoCoverage] BlockStatement
s3/index.js:65:17
     const str = await response.Body.transformToString()
 
     return str
-  } catch (err) {
-    return null
-  }
+  } catch (err) {}
 }
 

[Killed] BlockStatement
s3/index.js:77:7
     Bucket: bucketName,
   })
 
-  try {
-    let isTruncated = true
-    let keys = []
-
-    while (isTruncated) {
-      const { Contents, IsTruncated, NextContinuationToken } =
-        await client.send(command)
-
-      if (Contents) {
-        Contents.map((c) => keys.push(c.Key))
-      }
-
-      isTruncated = IsTruncated
-
-      command.input.ContinuationToken = NextContinuationToken
-    }
-
-    return keys
-  } catch (err) {
+  try {} catch (err) {
     console.error(err)
 
killedBy: Ending tests Deleting all Images in S3 Checking if images are present in the S3 bucket are only the seeded images 
statusReason: Cannot read properties of undefined (reading 'every')

[Survived] BooleanLiteral
s3/index.js:78:23
   })
 
   try {
-    let isTruncated = true
+    let isTruncated = false
     let keys = []
 

[Killed] ArrayDeclaration
s3/index.js:79:16
 
   try {
     let isTruncated = true
-    let keys = []
+    let keys = ["Stryker was here"]
 
     while (isTruncated) {
killedBy: Ending tests Deleting all Images in S3 Checking if images are present in the S3 bucket are only the seeded images 
statusReason: expected false to equal true

[Timeout] BlockStatement
s3/index.js:81:25
     let isTruncated = true
     let keys = []
 
-    while (isTruncated) {
-      const { Contents, IsTruncated, NextContinuationToken } =
-        await client.send(command)
-
-      if (Contents) {
-        Contents.map((c) => keys.push(c.Key))
-      }
-
-      isTruncated = IsTruncated
-
-      command.input.ContinuationToken = NextContinuationToken
-    }
+    while (isTruncated) {}
 
     return keys

[Survived] ConditionalExpression
s3/index.js:81:12
     let isTruncated = true
     let keys = []
 
-    while (isTruncated) {
+    while (false) {
       const { Contents, IsTruncated, NextContinuationToken } =
         await client.send(command)

[Survived] ConditionalExpression
s3/index.js:85:11
       const { Contents, IsTruncated, NextContinuationToken } =
         await client.send(command)
 
-      if (Contents) {
+      if (false) {
         Contents.map((c) => keys.push(c.Key))
       }

[Survived] ConditionalExpression
s3/index.js:85:11
       const { Contents, IsTruncated, NextContinuationToken } =
         await client.send(command)
 
-      if (Contents) {
+      if (true) {
         Contents.map((c) => keys.push(c.Key))
       }

[Survived] ArrowFunction
s3/index.js:86:22
         await client.send(command)
 
       if (Contents) {
-        Contents.map((c) => keys.push(c.Key))
+        Contents.map(() => undefined)
       }
 

[NoCoverage] BlockStatement
s3/index.js:95:17
     }
 
     return keys
-  } catch (err) {
-    console.error(err)
-
-    return null
-  }
+  } catch (err) {}
 }
 

[NoCoverage] EqualityOperator
s3/index.js:110:19
 
   const form = new FormData()
 
-  for (let i = 0; i < photos.length; i++) {
+  for (let i = 0; i <= photos.length; i++) {
     const { filename, title } = photos[parseInt(i)]
 

[NoCoverage] EqualityOperator
s3/index.js:110:19
 
   const form = new FormData()
 
-  for (let i = 0; i < photos.length; i++) {
+  for (let i = 0; i >= photos.length; i++) {
     const { filename, title } = photos[parseInt(i)]
 

[NoCoverage] StringLiteral
s3/index.js:115:32
 
     const { Body } = await getFileStream(filename)
 
-    const filePath = path.join("./public/img/temp", filename)
+    const filePath = path.join("", filename)
 
     await pipeline(Body, fs.createWriteStream(filePath))

[NoCoverage] ObjectLiteral
s3/index.js:119:57
 
     await pipeline(Body, fs.createWriteStream(filePath))
 
-    const buffer = await fs.promises.readFile(filePath, { encoding: "" })
+    const buffer = await fs.promises.readFile(filePath, {})
 
     await sharp(buffer)

[NoCoverage] BooleanLiteral
s3/index.js:123:25
 
     await sharp(buffer)
       .resize(maxWidth, maxHeight)
-      .webp({ lossless: true })
+      .webp({ lossless: false })
       .toBuffer()
       .then((resized) => {

[NoCoverage] ObjectLiteral
s3/index.js:123:13
 
     await sharp(buffer)
       .resize(maxWidth, maxHeight)
-      .webp({ lossless: true })
+      .webp({})
       .toBuffer()
       .then((resized) => {

[NoCoverage] BlockStatement
s3/index.js:125:26
       .resize(maxWidth, maxHeight)
       .webp({ lossless: true })
       .toBuffer()
-      .then((resized) => {
-        form.append(title, resized, filename)
-        form.append(
-          title + " - information",
-          JSON.stringify(photos[parseInt(i)])
-        )
-      })
+      .then((resized) => {})
 
     await unlinkFile(filePath)

[NoCoverage] StringLiteral
s3/index.js:137:5
   }
 
   res.setHeader(
-    "X-Content-Type",
+    "",
     "multipart/form-data; boundary=" + form._boundary
   )

[NoCoverage] BlockStatement
s3/index.js:171:15
   for (const filename of files) {
     const data = await getObjectData(filename)
 
-    if (data) {
-      console.log(filename, "exists already in S3.")
-      continue
-    }
+    if (data) {}
 
     const filePath = path.join(baseDirectory, filename)

[NoCoverage] MethodExpression
s3/index.js:178:27
 
     const filePath = path.join(baseDirectory, filename)
 
-    const fileExtension = filename.slice(
-      ((filename.lastIndexOf(".") - 1) >>> 0) + 2
-    )
+    const fileExtension = filename
 
     // eslint-disable-next-line security/detect-non-literal-fs-filename

[NoCoverage] ArithmeticOperator
s3/index.js:179:7
     const filePath = path.join(baseDirectory, filename)
 
     const fileExtension = filename.slice(
-      ((filename.lastIndexOf(".") - 1) >>> 0) + 2
+      (filename.lastIndexOf(".") - 1 >>> 0) - 2
     )
 

[NoCoverage] ArithmeticOperator
s3/index.js:179:9
     const filePath = path.join(baseDirectory, filename)
 
     const fileExtension = filename.slice(
-      ((filename.lastIndexOf(".") - 1) >>> 0) + 2
+      ((filename.lastIndexOf(".") + 1) >>> 0) + 2
     )
 

[NoCoverage] ConditionalExpression
s3/index.js:187:9
 
     const sharpInput = [buffer]
 
-    if (["gif"].includes(fileExtension)) {
+    if (true) {
       sharpInput.push({ animated: true })
     }

[NoCoverage] BlockStatement
s3/index.js:187:42
 
     const sharpInput = [buffer]
 
-    if (["gif"].includes(fileExtension)) {
-      sharpInput.push({ animated: true })
-    }
+    if (["gif"].includes(fileExtension)) {}
 
     await sharp(...sharpInput)

[NoCoverage] BooleanLiteral
s3/index.js:188:35
     const sharpInput = [buffer]
 
     if (["gif"].includes(fileExtension)) {
-      sharpInput.push({ animated: true })
+      sharpInput.push({ animated: false })
     }
 

[NoCoverage] ObjectLiteral
s3/index.js:188:23
     const sharpInput = [buffer]
 
     if (["gif"].includes(fileExtension)) {
-      sharpInput.push({ animated: true })
+      sharpInput.push({})
     }
 

[NoCoverage] BooleanLiteral
s3/index.js:193:25
 
     await sharp(...sharpInput)
       .resize({ width: 150 })
-      .webp({ lossless: true })
+      .webp({ lossless: false })
       .toBuffer()
       .then(async (resized) => {

[NoCoverage] BlockStatement
s3/index.js:195:32
       .resize({ width: 150 })
       .webp({ lossless: true })
       .toBuffer()
-      .then(async (resized) => {
-        uploadFile(resized, filename)
-      })
+      .then(async (resized) => {})
 
     console.log(filename + " is seeded into the S3 bucket.")

[NoCoverage] BlockStatement
s3/index.js:205:39
 
 exports.seedS3Images = seedS3Images
 
-const deleteAllS3Images = async () => {
-  const filenames = await getAllObjectKeys()
-
-  for (const filename of filenames) {
-    await deleteFile(filename)
-
-    console.log(filename + " is deleted from the S3 bucket.")
-  }
-}
+const deleteAllS3Images = async () => {}
 
 exports.deleteAllS3Images = deleteAllS3Images

[NoCoverage] BlockStatement
s3/index.js:208:37
 const deleteAllS3Images = async () => {
   const filenames = await getAllObjectKeys()
 
-  for (const filename of filenames) {
-    await deleteFile(filename)
-
-    console.log(filename + " is deleted from the S3 bucket.")
-  }
+  for (const filename of filenames) {}
 }
 
