[Timeout] ConditionalExpression
controllers/errorHandlers.js:19:7
 }
 
 const logErrorMiddleware = async (err, req, res, next) => {
-  if (!(err.code === "EBADCSRFTOKEN") && !isOperationalError(err)) {
+  if (true) {
     throw err
   }
