[Killed] ArrayDeclaration
controllers/photos.js:13:12
 const { validationPerusal, integerValidator } = require("./validators")
 
 const otherOptions = {
-  include: [
-    {
-      model: models.Caption,
-      as: "captions",
-      include: [
-        {
-          model: models.User,
-          as: "author",
-          attributes: { exclude: ["password"] },
-        },
-      ],
-      order: [["votes", "DESC"]],
-      limit: 10,
-    },
-    {
-      model: models.User,
-      as: "author",
-      attributes: { exclude: ["password"] },
-    },
-  ],
+  include: [],
 }
 
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { Object (id, username, ...) } to have property 'username' of 'Cassandra.OKeefe13', but got 'Ardella69'

[Killed] ArrayDeclaration
controllers/photos.js:21:34
         {
           model: models.User,
           as: "author",
-          attributes: { exclude: ["password"] },
+          attributes: { exclude: [] },
         },
       ],
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 319, …(5) } to have property 'id' of 4, but got 319

[Killed] StringLiteral
controllers/photos.js:29:11
     },
     {
       model: models.User,
-      as: "author",
+      as: "",
       attributes: { exclude: ["password"] },
     },
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 553, …(5) } to have property 'username' of 'Kody_Botsford40', but got 'Betsy.Waters6'

[Killed] ObjectLiteral
controllers/photos.js:36:15
 }
 
 const topPhotosSearch = {
-  attributes: {
-    include: [
-      [
-        models.Sequelize.literal(
-          // eslint-disable-next-line quotes
-          '(SELECT SUM("votes") FROM "Captions" WHERE "photoId" = "Photo"."id")'
-        ),
-        "totalVotes",
-      ],
-    ],
-  },
+  attributes: {},
   include: [
     {
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 319, …(5) } to have property 'id' of 4, but got 319

[Killed] ArrayDeclaration
controllers/photos.js:37:14
 
 const topPhotosSearch = {
   attributes: {
-    include: [
-      [
-        models.Sequelize.literal(
-          // eslint-disable-next-line quotes
-          '(SELECT SUM("votes") FROM "Captions" WHERE "photoId" = "Photo"."id")'
-        ),
-        "totalVotes",
-      ],
-    ],
+    include: [],
   },
   include: [
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 319, …(5) } to have property 'id' of 4, but got 319

[Killed] ArrayDeclaration
controllers/photos.js:38:7
 const topPhotosSearch = {
   attributes: {
     include: [
-      [
-        models.Sequelize.literal(
-          // eslint-disable-next-line quotes
-          '(SELECT SUM("votes") FROM "Captions" WHERE "photoId" = "Photo"."id")'
-        ),
-        "totalVotes",
-      ],
+      [],
     ],
   },
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 603, …(5) } to have property 'username' of 'Hyman70', but got 'Erika.Kertzmann90'

[Killed] StringLiteral
controllers/photos.js:41:11
       [
         models.Sequelize.literal(
           // eslint-disable-next-line quotes
-          '(SELECT SUM("votes") FROM "Captions" WHERE "photoId" = "Photo"."id")'
+          ""
         ),
         "totalVotes",
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 319, …(5) } to have property 'id' of 4, but got 319

[Killed] StringLiteral
controllers/photos.js:43:9
           // eslint-disable-next-line quotes
           '(SELECT SUM("votes") FROM "Captions" WHERE "photoId" = "Photo"."id")'
         ),
-        "totalVotes",
+        "",
       ],
     ],
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 319, …(5) } to have property 'id' of 4, but got 319

[Killed] ArrayDeclaration
controllers/photos.js:47:12
       ],
     ],
   },
-  include: [
-    {
-      model: models.Caption,
-      as: "captions",
-      attributes: [],
-    },
-  ],
+  include: [],
   group: ["Photo.id"],
   order: [[models.Sequelize.col("totalVotes"), "DESC"]],
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 629, …(5) } to have property 'username' of 'Manuel73', but got 'Randall.Erdman44'

[Killed] ObjectLiteral
controllers/photos.js:48:5
     ],
   },
   include: [
-    {
-      model: models.Caption,
-      as: "captions",
-      attributes: [],
-    },
+    {},
   ],
   group: ["Photo.id"],
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 631, …(5) } to have property 'username' of 'Nikolas_Abbott-Orn63', but got 'Brandy_Russel'

[Killed] StringLiteral
controllers/photos.js:50:11
   include: [
     {
       model: models.Caption,
-      as: "captions",
+      as: "",
       attributes: [],
     },
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 319, …(5) } to have property 'id' of 4, but got 319

[NoCoverage] BlockStatement
controllers/photos.js:59:59
   limit: 10,
 }
 
-exports.paramPhotoId = async (req, res, next, photoId) => {
-  const user = req.session.user
-
-  try {
-    await integerValidator("photoId", true).run(req)
-
-    validationPerusal(req, `User: ${user.id}`)
-
-    const searchParams = whereSearch({ id: photoId }, otherOptions)
-
-    const searched = await models.Photo.findOne(searchParams)
-
-    if (!searched) {
-      throw new Api404Error(
-        `User: ${user.id} photo was not found given photo id ${photoId}.`
-      )
-    }
-
-    req.photo = searched.dataValues
-
-    next()
-  } catch (err) {
-    next(err)
-  }
-}
+exports.paramPhotoId = async (req, res, next, photoId) => {}
 
 exports.postPhoto = async (req, res, next) => {

[NoCoverage] BlockStatement
controllers/photos.js:62:7
 exports.paramPhotoId = async (req, res, next, photoId) => {
   const user = req.session.user
 
-  try {
-    await integerValidator("photoId", true).run(req)
-
-    validationPerusal(req, `User: ${user.id}`)
-
-    const searchParams = whereSearch({ id: photoId }, otherOptions)
-
-    const searched = await models.Photo.findOne(searchParams)
-
-    if (!searched) {
-      throw new Api404Error(
-        `User: ${user.id} photo was not found given photo id ${photoId}.`
-      )
-    }
-
-    req.photo = searched.dataValues
-
-    next()
-  } catch (err) {
+  try {} catch (err) {
     next(err)
   }

[NoCoverage] BooleanLiteral
controllers/photos.js:63:39
   const user = req.session.user
 
   try {
-    await integerValidator("photoId", true).run(req)
+    await integerValidator("photoId", false).run(req)
 
     validationPerusal(req, `User: ${user.id}`)

[NoCoverage] BlockStatement
controllers/photos.js:71:20
 
     const searched = await models.Photo.findOne(searchParams)
 
-    if (!searched) {
-      throw new Api404Error(
-        `User: ${user.id} photo was not found given photo id ${photoId}.`
-      )
-    }
+    if (!searched) {}
 
     req.photo = searched.dataValues

[NoCoverage] StringLiteral
controllers/photos.js:73:9
 
     if (!searched) {
       throw new Api404Error(
-        `User: ${user.id} photo was not found given photo id ${photoId}.`
+        ``
       )
     }

[NoCoverage] StringLiteral
controllers/photos.js:88:23
 exports.postPhoto = async (req, res, next) => {
   const user = req.session.user
   const file = req.file
-  const preErrorMsg = `User: ${user.id}`
+  const preErrorMsg = ``
   const { buffer, originalname, mimetype } = file
   const filename = uuidv4() + ".webp"

[NoCoverage] StringLiteral
controllers/photos.js:90:31
   const file = req.file
   const preErrorMsg = `User: ${user.id}`
   const { buffer, originalname, mimetype } = file
-  const filename = uuidv4() + ".webp"
+  const filename = uuidv4() + ""
 
   const allowedFiles = ["png", "jpeg", "jpg", "gif"]

[NoCoverage] ArrayDeclaration
controllers/photos.js:92:24
   const { buffer, originalname, mimetype } = file
   const filename = uuidv4() + ".webp"
 
-  const allowedFiles = ["png", "jpeg", "jpg", "gif"]
+  const allowedFiles = []
   const allowedFileTypes = ["image/png", "image/jpeg", "image/jpg", "image/gif"]
 

[NoCoverage] StringLiteral
controllers/photos.js:93:29
   const filename = uuidv4() + ".webp"
 
   const allowedFiles = ["png", "jpeg", "jpg", "gif"]
-  const allowedFileTypes = ["image/png", "image/jpeg", "image/jpg", "image/gif"]
+  const allowedFileTypes = ["", "image/jpeg", "image/jpg", "image/gif"]
 
   try {

[NoCoverage] StringLiteral
controllers/photos.js:93:69
   const filename = uuidv4() + ".webp"
 
   const allowedFiles = ["png", "jpeg", "jpg", "gif"]
-  const allowedFileTypes = ["image/png", "image/jpeg", "image/jpg", "image/gif"]
+  const allowedFileTypes = ["image/png", "image/jpeg", "image/jpg", ""]
 
   try {

[NoCoverage] MethodExpression
controllers/photos.js:99:27
     validationPerusal(req, preErrorMsg)
 
     const title = req.body.title
-    const fileExtension = originalname.slice(
-      ((originalname.lastIndexOf(".") - 1) >>> 0) + 2
-    )
+    const fileExtension = originalname
 
     if (

[NoCoverage] ArithmeticOperator
controllers/photos.js:100:9
 
     const title = req.body.title
     const fileExtension = originalname.slice(
-      ((originalname.lastIndexOf(".") - 1) >>> 0) + 2
+      ((originalname.lastIndexOf(".") + 1) >>> 0) + 2
     )
 

[NoCoverage] ArithmeticOperator
controllers/photos.js:100:7
 
     const title = req.body.title
     const fileExtension = originalname.slice(
-      ((originalname.lastIndexOf(".") - 1) >>> 0) + 2
+      (originalname.lastIndexOf(".") - 1 >>> 0) - 2
     )
 

[NoCoverage] LogicalOperator
controllers/photos.js:104:7
     )
 
     if (
-      !allowedFiles.includes(fileExtension) ||
-      !allowedFileTypes.includes(mimetype)
+      !allowedFiles.includes(fileExtension) && !allowedFileTypes.includes(mimetype)
     ) {
       throw new Api400Error(

[NoCoverage] BooleanLiteral
controllers/photos.js:104:7
     )
 
     if (
-      !allowedFiles.includes(fileExtension) ||
+      allowedFiles.includes(fileExtension) ||
       !allowedFileTypes.includes(mimetype)
     ) {

[NoCoverage] BooleanLiteral
controllers/photos.js:105:7
 
     if (
       !allowedFiles.includes(fileExtension) ||
-      !allowedFileTypes.includes(mimetype)
+      allowedFileTypes.includes(mimetype)
     ) {
       throw new Api400Error(

[NoCoverage] BlockStatement
controllers/photos.js:106:7
     if (
       !allowedFiles.includes(fileExtension) ||
       !allowedFileTypes.includes(mimetype)
-    ) {
-      throw new Api400Error(
-        `User: ${user.id} tried uploading file that was not an image.`
-      )
-    }
+    ) {}
 
     const sharpInput = [buffer]

[NoCoverage] ArrayDeclaration
controllers/photos.js:112:24
       )
     }
 
-    const sharpInput = [buffer]
+    const sharpInput = []
 
     if (["gif"].includes(fileExtension)) {

[NoCoverage] ObjectLiteral
controllers/photos.js:119:15
     }
 
     await sharp(...sharpInput)
-      .resize({ width: 150 })
+      .resize({})
       .webp({ lossless: true })
       .toBuffer()

[NoCoverage] BlockStatement
controllers/photos.js:122:32
       .resize({ width: 150 })
       .webp({ lossless: true })
       .toBuffer()
-      .then(async (resized) => {
-        await uploadFile(resized, filename)
-      })
+      .then(async (resized) => {})
 
     const created = await models.Photo.create({

[NoCoverage] ObjectLiteral
controllers/photos.js:136:26
       throw new Api500Error(`User: ${user.id} create query did not work.`)
     }
 
-    res.status(201).json({
-      imagePath: `/photos/${title}`,
-      msg: `User: ${user.id} has uploaded a photo.`,
-    })
+    res.status(201).json({})
   } catch (err) {
     next(err)

[NoCoverage] StringLiteral
controllers/photos.js:138:12
 
     res.status(201).json({
       imagePath: `/photos/${title}`,
-      msg: `User: ${user.id} has uploaded a photo.`,
+      msg: ``,
     })
   } catch (err) {

[NoCoverage] BlockStatement
controllers/photos.js:140:17
       imagePath: `/photos/${title}`,
       msg: `User: ${user.id} has uploaded a photo.`,
     })
-  } catch (err) {
-    next(err)
-  }
+  } catch (err) {}
 }
 

[NoCoverage] BlockStatement
controllers/photos.js:160:20
 
     const searched = await models.Photo.findAll(searchParams)
 
-    if (!searched) {
-      throw new Api401Error(`User: ${user.id} photos were not found` + afterMsg)
-    }
+    if (!searched) {}
 
     const photos = searched.map((photo) => photo.dataValues)

[NoCoverage] ArrowFunction
controllers/photos.js:164:33
       throw new Api401Error(`User: ${user.id} photos were not found` + afterMsg)
     }
 
-    const photos = searched.map((photo) => photo.dataValues)
+    const photos = searched.map(() => undefined)
 
     await attachFilesToResponse(res, photos)

[NoCoverage] BlockStatement
controllers/photos.js:167:17
     const photos = searched.map((photo) => photo.dataValues)
 
     await attachFilesToResponse(res, photos)
-  } catch (err) {
-    next(err)
-  }
+  } catch (err) {}
 }
 

[NoCoverage] BlockStatement
controllers/photos.js:172:46
   }
 }
 
-exports.getPhoto = async (req, res, next) => {
-  const photo = req.photo
-
-  try {
-    await attachFilesToResponse(res, [photo])
-  } catch (err) {
-    next(err)
-  }
-}
+exports.getPhoto = async (req, res, next) => {}
 
 exports.putPhoto = async (req, res, next) => {

[NoCoverage] BlockStatement
controllers/photos.js:175:7
 exports.getPhoto = async (req, res, next) => {
   const photo = req.photo
 
-  try {
-    await attachFilesToResponse(res, [photo])
-  } catch (err) {
+  try {} catch (err) {
     next(err)
   }

[NoCoverage] BlockStatement
controllers/photos.js:177:17
 
   try {
     await attachFilesToResponse(res, [photo])
-  } catch (err) {
-    next(err)
-  }
+  } catch (err) {}
 }
 

[NoCoverage] EqualityOperator
controllers/photos.js:188:9
   const { title } = req.body
 
   try {
-    if (photo.userId !== user.id) {
+    if (photo.userId === user.id) {
       throw new Api403Error(
         `User: ${user.id} cannot update a photo that does not belong to them.`

[NoCoverage] ConditionalExpression
controllers/photos.js:188:9
   const { title } = req.body
 
   try {
-    if (photo.userId !== user.id) {
+    if (false) {
       throw new Api403Error(
         `User: ${user.id} cannot update a photo that does not belong to them.`

[NoCoverage] StringLiteral
controllers/photos.js:190:9
   try {
     if (photo.userId !== user.id) {
       throw new Api403Error(
-        `User: ${user.id} cannot update a photo that does not belong to them.`
+        ``
       )
     }

[NoCoverage] ObjectLiteral
controllers/photos.js:196:62
 
     const updatedValues = { title }
 
-    const updated = await models.Photo.update(updatedValues, {
-      where: { id: photo.id },
-    })
+    const updated = await models.Photo.update(updatedValues, {})
 
     if (!updated) {

[NoCoverage] BooleanLiteral
controllers/photos.js:200:9
       where: { id: photo.id },
     })
 
-    if (!updated) {
+    if (updated) {
       throw new Api500Error(
         `User: ${user.id} update photo name query did not work.`

[NoCoverage] StringLiteral
controllers/photos.js:202:9
 
     if (!updated) {
       throw new Api500Error(
-        `User: ${user.id} update photo name query did not work.`
+        ``
       )
     }

[NoCoverage] EqualityOperator
controllers/photos.js:218:5
   const user = req.session.user
   const preErrorMsg = `User: ${user.id}`
   let targetIsSelf =
-    req.body.userId === undefined ? true : user.id === req.body.userId
+    req.body.userId !== undefined ? true : user.id === req.body.userId
   const responseMsg = targetIsSelf
     ? `User: ${user.id} has deleted all of their own photos associated`

[NoCoverage] ConditionalExpression
controllers/photos.js:218:5
   const user = req.session.user
   const preErrorMsg = `User: ${user.id}`
   let targetIsSelf =
-    req.body.userId === undefined ? true : user.id === req.body.userId
+    true ? true : user.id === req.body.userId
   const responseMsg = targetIsSelf
     ? `User: ${user.id} has deleted all of their own photos associated`

[NoCoverage] BlockStatement
controllers/photos.js:224:41
     : `User: ${user.id} has deleted all of the photos of a user associated`
 
   try {
-    if (!targetIsSelf && !user.isAdmin) {
-      throw new Api403Error(
-        `User: ${user.id} cannot delete photos that does not belong to them.`
-      )
-    }
+    if (!targetIsSelf && !user.isAdmin) {}
 
     validationPerusal(req, preErrorMsg)

[NoCoverage] BooleanLiteral
controllers/photos.js:224:9
     : `User: ${user.id} has deleted all of the photos of a user associated`
 
   try {
-    if (!targetIsSelf && !user.isAdmin) {
+    if (targetIsSelf && !user.isAdmin) {
       throw new Api403Error(
         `User: ${user.id} cannot delete photos that does not belong to them.`

[NoCoverage] BlockStatement
controllers/photos.js:240:47
 
     const searched = await models.Photo.findAll(searchParams)
 
-    const filenames = searched.map((photo) => {
-      return photo.dataValues.filename
-    })
+    const filenames = searched.map((photo) => {})
 
     for (let i = 0; i < filenames.length; i++) {

[NoCoverage] EqualityOperator
controllers/photos.js:244:21
       return photo.dataValues.filename
     })
 
-    for (let i = 0; i < filenames.length; i++) {
+    for (let i = 0; i <= filenames.length; i++) {
       await deleteFile(filenames[parseInt(i)])
     }

[NoCoverage] UpdateOperator
controllers/photos.js:244:43
       return photo.dataValues.filename
     })
 
-    for (let i = 0; i < filenames.length; i++) {
+    for (let i = 0; i < filenames.length; i--) {
       await deleteFile(filenames[parseInt(i)])
     }

[NoCoverage] BlockStatement
controllers/photos.js:250:19
 
     const deleted = await models.Photo.destroy(searchParams)
 
-    if (!deleted) {
-      throw new Api500Error(
-        `User: ${user.id} delete photos query did not work given a user ` +
-          afterMsg
-      )
-    }
+    if (!deleted) {}
 
     res.send(responseMsg + afterMsg)

[NoCoverage] ArithmeticOperator
controllers/photos.js:257:14
       )
     }
 
-    res.send(responseMsg + afterMsg)
+    res.send(responseMsg - afterMsg)
   } catch (err) {
     next(err)

[NoCoverage] BlockStatement
controllers/photos.js:270:7
     ? `User: ${user.id} has deleted one of user id ${photo.userId} photos.`
     : `User: ${user.id} has deleted one of their own photos.`
 
-  try {
-    if (photo.userId !== user.id && !user.isAdmin) {
-      throw new Api403Error(
-        `User: ${user.id} cannot delete a photo that does not belong to them.`
-      )
-    }
-
-    const deleted = await models.Photo.destroy({
-      where: { id: photo.id },
-    })
-
-    if (!deleted) {
-      throw new Api500Error(
-        `User: ${user.id} delete photo with photo id query did not work.`
-      )
-    }
-
-    await deleteFile(photo.filename)
-
-    res.send(responseMsg)
-  } catch (err) {
+  try {} catch (err) {
     next(err)
   }

[NoCoverage] ConditionalExpression
controllers/photos.js:271:9
     : `User: ${user.id} has deleted one of their own photos.`
 
   try {
-    if (photo.userId !== user.id && !user.isAdmin) {
+    if (true) {
       throw new Api403Error(
         `User: ${user.id} cannot delete a photo that does not belong to them.`

[NoCoverage] ConditionalExpression
controllers/photos.js:271:9
     : `User: ${user.id} has deleted one of their own photos.`
 
   try {
-    if (photo.userId !== user.id && !user.isAdmin) {
+    if (true && !user.isAdmin) {
       throw new Api403Error(
         `User: ${user.id} cannot delete a photo that does not belong to them.`

[NoCoverage] ObjectLiteral
controllers/photos.js:278:14
     }
 
     const deleted = await models.Photo.destroy({
-      where: { id: photo.id },
+      where: {},
     })
 

[NoCoverage] ConditionalExpression
controllers/photos.js:281:9
       where: { id: photo.id },
     })
 
-    if (!deleted) {
+    if (true) {
       throw new Api500Error(
         `User: ${user.id} delete photo with photo id query did not work.`
