[Killed] StringLiteral
routes/captions.js:24:3
 captionsRouter.get("/:captionId", captionsControllers.getCaption)
 
 captionsRouter.put(
-  "/:captionId",
+  "",
   textValidator("text"),
   captionsControllers.putCaption
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 782, username: 'username', …(4) } to have property 'id' of 4, but got 782
