[Survived] ArrayDeclaration
controllers/users.js:19:30
 
     const searched = await models.User.findOne({
       where: { username: username },
-      attributes: { exclude: ["password"] },
+      attributes: { exclude: [] },
       include: [
         {

[Survived] ObjectLiteral
controllers/users.js:19:19
 
     const searched = await models.User.findOne({
       where: { username: username },
-      attributes: { exclude: ["password"] },
+      attributes: {},
       include: [
         {

[Survived] ArrayDeclaration
controllers/users.js:24:18
         {
           model: models.Photo,
           as: "photos",
-          order: [["id", "DESC"]],
+          order: [],
           limit: 10,
         },

[Timeout] BlockStatement
controllers/users.js:45:46
   }
 }
 
-exports.getUsers = async (req, res, next) => {
-  try {
-    const searched = await models.User.findAll({
-      attributes: { exclude: ["password"] },
-      include: [
-        {
-          model: models.Photo,
-          as: "photos",
-          order: [["id", "DESC"]],
-          limit: 10,
-        },
-      ],
-      order: [["id", "DESC"]],
-      limit: 20,
-    })
-
-    res.json(searched)
-  } catch (err) {
-    next(err)
-  }
-}
+exports.getUsers = async (req, res, next) => {}
 
 exports.getUser = async (req, res, next) => {

[Timeout] BlockStatement
controllers/users.js:46:7
 }
 
 exports.getUsers = async (req, res, next) => {
-  try {
-    const searched = await models.User.findAll({
-      attributes: { exclude: ["password"] },
-      include: [
-        {
-          model: models.Photo,
-          as: "photos",
-          order: [["id", "DESC"]],
-          limit: 10,
-        },
-      ],
-      order: [["id", "DESC"]],
-      limit: 20,
-    })
-
-    res.json(searched)
-  } catch (err) {
+  try {} catch (err) {
     next(err)
   }

[Killed] ArrayDeclaration
controllers/users.js:48:30
 exports.getUsers = async (req, res, next) => {
   try {
     const searched = await models.User.findAll({
-      attributes: { exclude: ["password"] },
+      attributes: { exclude: [] },
       include: [
         {
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 230, …(6) } to have property 'id' of 4, but got 230

[Timeout] BlockStatement
controllers/users.js:67:45
   }
 }
 
-exports.getUser = async (req, res, next) => {
-  const targetUser = req.targetUser
-
-  try {
-    res.json(targetUser)
-  } catch (err) {
-    next(err)
-  }
-}
+exports.getUser = async (req, res, next) => {}
 
 exports.putUser = async (req, res, next) => {

[Timeout] BlockStatement
controllers/users.js:70:7
 exports.getUser = async (req, res, next) => {
   const targetUser = req.targetUser
 
-  try {
-    res.json(targetUser)
-  } catch (err) {
+  try {} catch (err) {
     next(err)
   }

[NoCoverage] BlockStatement
controllers/users.js:72:17
 
   try {
     res.json(targetUser)
-  } catch (err) {
-    next(err)
-  }
+  } catch (err) {}
 }
 

[Killed] BooleanLiteral
controllers/users.js:86:25
 
     const { username, password, newUsername, newPassword } = req.body
 
-    if (!newUsername && !newPassword) {
+    if (!newUsername && newPassword) {
       throw new Api400Error(`User: ${user.id} did not update any values.`)
     }
killedBy: Users route Put / When no new credentials are added, then response is a bad request
statusReason: expected 200 to equal 400

[Killed] ConditionalExpression
controllers/users.js:86:9
 
     const { username, password, newUsername, newPassword } = req.body
 
-    if (!newUsername && !newPassword) {
+    if (true) {
       throw new Api400Error(`User: ${user.id} did not update any values.`)
     }
killedBy: Users route Put / When a valid new username is provided, then response is ok; Users route Put / When a valid new username is provided, then response is ok
statusReason: expected 400 to equal 200

[Killed] ObjectLiteral
controllers/users.js:91:50
     }
 
     if (newUsername) {
-      const searched = await models.User.findOne({
-        where: { username: newUsername },
-      })
+      const searched = await models.User.findOne({})
 
       if (searched) {
killedBy: Users route Put / When a valid new username is provided, then response is ok; Users route Put / When a valid new username is provided, then response is ok
statusReason: expected 400 to equal 200

[Survived] StringLiteral
controllers/users.js:97:11
 
       if (searched) {
         throw new Api400Error(
-          `User: ${user.id} new username, ${newUsername}, is already in use.`
+          ``
         )
       }

[Killed] BlockStatement
controllers/users.js:108:22
       updatedAt: new Date(),
     }
 
-    if (newUsername) {
-      updatedValues.username = newUsername
-    }
+    if (newUsername) {}
 
     if (newPassword) {
killedBy: Users route Put / When a valid new username is provided, then response is ok; Users route Put / When a valid new username is provided, then response is ok
statusReason: expected 401 to equal 200

[Killed] BlockStatement
controllers/users.js:112:22
       updatedValues.username = newUsername
     }
 
-    if (newPassword) {
-      const hashedNewPassword = await passwordHash(newPassword, saltRounds)
-
-      updatedValues.password = hashedNewPassword
-    }
+    if (newPassword) {}
 
     const updated = await models.User.update(updatedValues, {
killedBy: Users route Put / When a valid new password is provided, then response is ok
statusReason: expected 401 to equal 200

[Killed] ConditionalExpression
controllers/users.js:137:24
 exports.deleteUser = async (req, res, next) => {
   const user = req.session.user
   const targetUser = req.targetUser
-  const targetIsSelf = user.id === targetUser.id
+  const targetIsSelf = true
   const responseMsg = targetIsSelf
     ? `User: ${user.id} has deleted their own account.`
killedBy: Users route Delete /:username When regular user tries to delete other user, then response is forbidden
statusReason: expected 400 to equal 403

[NoCoverage] BlockStatement
controllers/users.js:162:19
       },
     })
 
-    if (!deleted) {
-      throw new Api500Error(
-        `User: ${user.id} delete a user query did not work because query went wrong or the target user is an admin.`
-      )
-    }
+    if (!deleted) {}
 
     if (targetIsSelf) {

[Killed] ConditionalExpression
controllers/users.js:168:9
       )
     }
 
-    if (targetIsSelf) {
+    if (false) {
       req.session.authorized = false
 
killedBy: Users route Delete /:username When admin inputs username to delete another user, then user is deleted with a response message
statusReason: expected 400 to equal 200
