[Killed] StringLiteral
routes/logout.js:7:19
 
 logoutRouter.get("/", logoutControllers.getLogout)
 
-logoutRouter.post("/", logoutControllers.postLogout)
+logoutRouter.post("", logoutControllers.postLogout)
 
 module.exports = logoutRouter
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 782, username: 'username', …(4) } to have property 'id' of 4, but got 782
