[Killed] ObjectLiteral
routes/photos.js:12:23
 const { photosControllers } = require("../controllers/index")
 
 const multer = require("multer")
-const upload = multer({
-  dest: "../public/img/temp/",
-  storage: multer.memoryStorage(),
-  limits: {
-    fileSize: 5 * 1024 * 1024, // limit file size to 5MB
-  },
-})
+const upload = multer({})
 
 photosRouter.param("photoId", photosControllers.paramPhotoId)
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 782, username: 'username', …(4) } to have property 'id' of 4, but got 782

[Killed] ArithmeticOperator
routes/photos.js:16:15
   dest: "../public/img/temp/",
   storage: multer.memoryStorage(),
   limits: {
-    fileSize: 5 * 1024 * 1024, // limit file size to 5MB
+    fileSize: 5 / 1024 * 1024, // limit file size to 5MB
   },
 })
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 782, username: 'username', …(4) } to have property 'id' of 4, but got 782

[Killed] ArithmeticOperator
routes/photos.js:16:15
   dest: "../public/img/temp/",
   storage: multer.memoryStorage(),
   limits: {
-    fileSize: 5 * 1024 * 1024, // limit file size to 5MB
+    fileSize: 5 * 1024 / 1024, // limit file size to 5MB
   },
 })
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 1414, …(5) } to have property 'username' of 'Vidal.Runte-Beier90', but got 'Crystal_Leuschke85'

[Killed] StringLiteral
routes/photos.js:23:3
 photosRouter.param("photoId", photosControllers.paramPhotoId)
 
 photosRouter.post(
-  "/",
+  "",
   upload.single("photo"),
   postPhotosValidator(),
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 782, username: 'username', …(4) } to have property 'id' of 4, but got 782

[Killed] StringLiteral
routes/photos.js:24:17
 
 photosRouter.post(
   "/",
-  upload.single("photo"),
+  upload.single(""),
   postPhotosValidator(),
   photosControllers.postPhoto
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 782, username: 'username', …(4) } to have property 'id' of 4, but got 782

[Killed] StringLiteral
routes/photos.js:34:3
 photosRouter.get("/:photoId", photosControllers.getPhoto)
 
 photosRouter.put(
-  "/:photoId",
+  "",
   textValidator("title"),
   photosControllers.putPhoto
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 782, username: 'username', …(4) } to have property 'id' of 4, but got 782
