[Killed] StringLiteral
routes/users.js:7:19
 const { credentialsValidator, newCredentialsValidator } =
   require("../controllers/index").validators
 
-usersRouter.param("username", usersControllers.paramUsername)
+usersRouter.param("", usersControllers.paramUsername)
 
 usersRouter.get("/", usersControllers.getUsers)
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 1495, …(5) } to have property 'username' of 'Chet_Waters', but got 'Clifton.Nolan'

[Killed] StringLiteral
routes/users.js:11:17
 
 usersRouter.get("/", usersControllers.getUsers)
 
-usersRouter.get("/:username", usersControllers.getUser)
+usersRouter.get("", usersControllers.getUser)
 
 usersRouter.put(
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 782, username: 'username', …(4) } to have property 'id' of 4, but got 782

[Killed] StringLiteral
routes/users.js:21:3
 )
 
 usersRouter.delete(
-  "/:username",
+  "",
   credentialsValidator(),
   usersControllers.deleteUser
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 1518, …(5) } to have property 'id' of 4, but got 1518
