[Killed] ObjectLiteral
util/logger.js:6:12
 // const Logsene = require("winston-logsene")
 
 const options = {
-  console: {
-    level: "debug",
-    handleExceptions: true,
-    json: false,
-    colorize: true,
-  },
+  console: {},
   // logsene: {
   //   token: process.env.LOGS_TOKEN,
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(6) ] to have the same members as [ …(3) ]

[Killed] StringLiteral
util/logger.js:7:12
 
 const options = {
   console: {
-    level: "debug",
+    level: "",
     handleExceptions: true,
     json: false,
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(6) ] to have the same members as [ …(3) ]

[Killed] BooleanLiteral
util/logger.js:8:23
 const options = {
   console: {
     level: "debug",
-    handleExceptions: true,
+    handleExceptions: false,
     json: false,
     colorize: true,
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Killed] BooleanLiteral
util/logger.js:9:11
   console: {
     level: "debug",
     handleExceptions: true,
-    json: false,
+    json: true,
     colorize: true,
   },
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Killed] BooleanLiteral
util/logger.js:10:15
     level: "debug",
     handleExceptions: true,
     json: false,
-    colorize: true,
+    colorize: false,
   },
   // logsene: {
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Killed] ArrayDeclaration
util/logger.js:22:15
 
 const logger = winston.createLogger({
   levels: winston.config.npm.levels,
-  transports: [
-    new winston.transports.Console(options.console),
-    // new Logsene(options.logsene),
-  ],
+  transports: [],
   exitOnError: false,
 })
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]

[Killed] BooleanLiteral
util/logger.js:26:16
     new winston.transports.Console(options.console),
     // new Logsene(options.logsene),
   ],
-  exitOnError: false,
+  exitOnError: true,
 })
 
killedBy: AWS-SDK S3 client s3.getAllObjectKeys When function is called, Then all the object keys in the s3 bucket are returned
statusReason: expected [ …(4) ] to have the same members as [ …(3) ]
