[NoCoverage] BlockStatement
controllers/register.js:32:19
       updatedAt: new Date(),
     })
 
-    if (!created) {
-      throw new Api500Error(
-        "Client: creating user query failed and was unable to finish."
-      )
-    }
+    if (!created) {}
 
     res.status(201).send(`User: ${created.dataValues.id} is created.`)

[NoCoverage] StringLiteral
controllers/register.js:34:9
 
     if (!created) {
       throw new Api500Error(
-        "Client: creating user query failed and was unable to finish."
+        ""
       )
     }
