[Killed] ConditionalExpression
controllers/validators.js:17:9
   let head = requestProperty(input)
 
   if (!inputIsParam) {
-    if (optional) {
+    if (false) {
       head = head.optional({ nullable: true, checkFalsy: true })
     }
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 565, …(5) } to have property 'username' of 'Stephon.Hahn37', but got 'Arvel.Wintheiser44'

[Killed] ConditionalExpression
controllers/validators.js:124:19
 
   let afterNonUniqueErrorMsg = ""
 
-  for (let i = 0; i < allowedInputs.length; i++) {
+  for (let i = 0; false; i++) {
     if (parseInt(i) === allowedInputs.length - 1) {
       afterNonUniqueErrorMsg += 'or "' + allowedInputs[parseInt(i)] + '."'
killedBy: Users route Get / When an authorized request is made, then all the users are in the response
statusReason: expected { id: 790, username: 'Heber60', …(4) } to have property 'id' of 4, but got 790
