[NoCoverage] BlockStatement
util/search.js:8:32
 
 exports.sentenceCase = sentenceCase
 
-const selfSearch = (userId) => {
-  return { where: { userId: userId } }
-}
+const selfSearch = (userId) => {}
 
 exports.selfSearch = selfSearch
