[Killed] ConditionalExpression
app.js:13:18
 
 const initializeWebServer = () => {
   return new Promise((resolve) => {
-    const PORT = process.env.PORT || 0
+    const PORT = false
 
     server = https
statusReason: The argument 'options' is invalid. Received { port: false }
